const   mongoose   = require("mongoose"),
        Artist     = require("./models/artist"),
        Song       = require("./models/song"),
        User       = require("./models/user");     
const { all } = require("./routes");

const data = [
        {
            name: "Tilly Birds",
            img: "https://inzpy.com/wp-content/uploads/2022/03/1-11.jpg",
            songs: []
        },
        {
            name: "Nont Tanont(นนท์ ธนนท์)",
            img: "https://cdn.discordapp.com/attachments/876849992910917632/968158045861474314/unknown.png",
            songs: []
        },
        {
            name: "THE TOYS(เดอะ ทอย)",
            img: "https://mellow975.mcot.net/uploads/article/article_5d354f303c4e2.jpg",
            songs: []
        },
        {
            name: "F.Hero(กอล์ฟ ฟลักกลิ้งฮีโร่)",
            img: "https://s.isanook.com/jo/0/rp/r/w728/ya0xa0m1w0/aHR0cHM6Ly9zLmlzYW5vb2suY29tL2pvLzAvdWQvNDgyLzI0MTE5NjkveS5qcGc=.jpg",
            songs: []
        },
        {
            name: "Kangsomks(แกงส้ม ธนทัต)",
            img: "https://static.thairath.co.th/media/4DQpjUtzLUwmJZZPG1rU1gvpaScUfSC6IRucl3v8YPLr.jpg",
            songs: []
        },
        {
            name:"Patrickananda(แพทริค อนันดา)",
            img: "https://www.fungjaizine.com/wp-content/uploads/2019/09/patrickananda-1024x1024.jpg",
            songs: []
        }
];

const songTilly = [
    {
        nameSong: "ถ้าเราเจอกันอีก (Until Then)",
        imgSong: "https://www.thaiticketmajor.com/variety/img_content/imgeditor/S__21717281.jpg",
        type: "pop",
        lyric: `จากวันนั้น ที่เธอได้ไปจากฉัน
                ไม่รู้เธออยู่ที่ไหน ตอนนี้เธอเป็นอย่างไร

                เธอจากไปไม่ลาสักคำ
                อยากแค่ขอสบตาเธออีกครั้ง

                ที่เธอไป ฉันยอมรับและเข้าใจ
                ไม่ว่าอะไรเธอเลย ยังรักเธอ รู้ใช่ไหม

                ใจฉันยังคิดถึงเหมือนเคย
                ไม่มีใครแทนที่เธอได้เลย

                ถ้าเราได้เจอกันอีกสักวัน อยากถาม
                เธอจำฉันได้อยู่หรือเปล่า
                เธอจะยิ้มให้ฉันหรือเปล่า
                หากเราได้เจอกันอีกสักครั้ง อยากขอ
                กอดเธอไว้ให้อุ่นเหมือนเก่า
                ให้คำว่าเรายังคง
                เหมือนเดิม ไม่เคยจางหายไป
                เหมือนเดิม ไม่เคยจางหายไป
                เหมือนเดิม ไม่เคยจางหาย
                แม้นานเท่าไร ฉันรอเธอได้เสมอ

                ยังคงยิ้ม ให้ความทรงจำทุกชิ้น (ให้ความทรงจำทุกชิ้น)
                รูปเรา เธอเก็บไว้ไหม (รูปเรา เธอเก็บไว้ไหม)
                เพราะฉันไม่เคยโยนทิ้ง (ไม่เคยโยนทิ้ง)

                สิ่งดี ๆ ไม่เคยหายไป
                เธอเคยลองนึกถึงมันบ้างไหม

                ถ้าเราได้เจอกันอีกสักวัน อยากถาม
                เธอจำฉันได้อยู่หรือเปล่า
                เธอจะยิ้มให้ฉันหรือเปล่า
                หากเราได้เจอกันอีกสักครั้ง อยากขอ
                กอดเธอไว้ให้อุ่นเหมือนเก่า
                ให้คำว่าเรายังคงเหมือนเดิม

                ฟ้าและท้องทะเลต้องห่างกัน
                เหมือนที่เราทั้งสองต้องจากกัน ฉันเข้าใจ
                แม้ว่าเธอไม่หวนคืนกลับมา
                ขอแค่เธอไม่ลืมช่วงเวลา ที่มีความหมาย

                ถ้าเราได้เจอกันอีกสักครั้ง อยากถาม
                เธอจำฉันได้อยู่หรือเปล่า
                เธอจะยิ้มให้ฉันหรือเปล่า
                หากเราได้เจอกันอีกสักครั้ง อยากขอ
                กอดเธอไว้ให้อุ่นเหมือนเก่า
                ให้คำว่าเรายังคง
                เหมือนเดิม ไม่เคยจางหายไป
                เหมือนเดิม ไม่เคยจางหายไป
                เหมือนเดิม ไม่เคยจางหาย
                แม้นานเท่าไรฉันรอ เธอได้เสมอ`,
        audio: '/upload/ถ้าเราเจอกันอีก (Until Then).mp3',
        fav: 20000
    },
    {
        nameSong: "เพื่อนเล่น ไม่เล่นเพื่อน (Just Being Friendly)",
        imgSong: "https://i.ytimg.com/vi/AJEoJYgktb4/maxresdefault.jpg",
        type: "rap",
        lyric: `หยุดคิดแบบนี้
                หยุดคิดเลย
                รู้สึกดีทั้งที่เป็นแค่เพื่อนกัน

                หยุดไว้แค่นี้
                หยุดไว้เลย
                ได้โปรด เธออย่าเล่นเกินไปกว่านั้น

                เล่นทักมาหาฉันเสมอแทบทุกคืนวัน
                มากเกินกว่าเพื่อนควรจะเป็น
                เล่นเป็นห่วงฉันแม้ในเรื่องที่ไม่สำคัญ

                เธอชอบมาทำให้ฉัน เอ๊ะ ยังไง
                ที่เล่นแบบนี้นั้นมันแปลว่าไง
                ฉันยังสับสนและสงสัย
                เป็นเพื่อนกันต้องเล่นแบบไหน

                ได้แต่พยายามจะไม่คิดอะไร
                ที่ไม่ควรคิด
                เวลาที่เราใกล้ชิดมากไป
                รู้ตัวอีกที ในใจมีแต่คำถาม
                มากมายเกินจะทนไหว
                บอกฉันทีจะได้ไหม

                ถ้าเธอให้ฉันเป็นเพื่อนเล่น
                อย่าเล่นเกินกว่านั้นได้ไหม
                ถ้าฉันเล่นเกินเส้นไป เธอรับได้ไหม
                ช่วยบอกฉันสักทีว่าที่ฉันยืน
                เธอยืนที่เดียวกันไหม
                หยุดเล่นเกินเพื่อนเล่น (หยุดเล่นเกินเพื่อนเล่น)

                เอ่อ คือตอนนี้เราเป็นแค่เพื่อนกัน
                และฉันก็คิด
                อยากมีสิทธิ์มากกว่านั้น (อ๋อ ได้เลย)
                งั้นเธอคือเพื่อนสนิทของฉัน

                เพื่อนอะไรบอกฝันดีก่อนนอน
                เพื่อนแบบไหนดมหัวแล้วบอกหอม
                เริ่มไม่แน่ใจ เอาหน้ามาใกล้ตลอด
                เวลาฉันต้องการใคร ก็เป็นเธอที่มากอด

                ใจเธอคิดเหมือนกันหรือเปล่า
                เจอแบบนี้ไป ฉันแอบเผลอใจให้ไป
                แม้มันไม่อาจเป็นจริง

                ถ้าเธอให้ฉันเป็นเพื่อนเล่น
                อย่าเล่นเกินกว่านั้นได้ไหม
                ถ้าฉันเล่นเกินเส้นไป เธอรับได้ไหม
                ช่วยบอกฉันสักที ว่าที่ฉันยืน
                เธอยืนที่เดียวกันไหม

                ถ้าเธอไม่เคยที่จะรู้สึกเหมือนที่ใจฉันรู้สึก
                แค่เพื่อนเล่น ฉันก็เป็นให้เธอไม่ไหว
                จะได้พร้อมทำใจ รอให้เธอบอก
                ว่าเป็นเพื่อนกันเท่านั้น
                หยุดเล่นเกินเพื่อนเล่น
                
                ได้แต่พยายามจะไม่คิดอะไร
                ที่ไม่ควรคิด
                เวลาที่เราใกล้ชิดมากไป
                รู้ตัวอีกที ในใจมีแต่คำถาม
                มากมายเกินจะทนไหว
                บอกฉันทีจะได้ไหม

                ถ้าเธอให้ฉันเป็นเพื่อนเล่น
                อย่าเล่นเกินกว่านั้นได้ไหม
                ถ้าฉันเล่นเกินเส้นไป เธอรับได้ไหม
                ช่วยบอกฉันสักที ว่าที่ฉันยืน
                เธอยืนที่เดียวกันไหม

                ถ้าเธอไม่เคยที่จะรู้สึกเหมือนที่ใจฉันรู้สึก
                แค่เพื่อนเล่น ฉันก็เป็นให้เธอไม่ไหว
                จะได้พร้อมทำใจ รอให้เธอบอก
                ว่าเป็นเพื่อนกันเท่านั้น
                หยุดเล่นเกินเพื่อนเล่น`,
        audio: '/upload/เพื่อนเล่น ไม่เล่นเพื่อน (Just Being Friendly).mp3',
        fav: 21564
    },
    {
        nameSong: "ติดตรงที่ฉัน (It's Not You, It's Me)",
        imgSong: "https://i.ytimg.com/vi/tuacCZ21WI8/maxresdefault.jpg",
        type: "pop",
        lyric: `ไม่คิดว่าจะมีใครที่ทำให้รู้สึกดีอย่างนี้
                เธอเข้ามาทำให้ใจที่มันเคยเป็นสีเทาไม่เหงา

                ทักมาตอนฉันตื่นพูดว่าฝันดีทุกคืน ห่วงใยกันในทุกวันทำให้ฉันดูสำคัญ
                ทำให้ยิ้มทุกครั้งวันที่ใจของฉันพังเหมือนว่าเธอคือคนในฝัน

                แต่ติดตรงที่ฉัน
                เพิ่งโดนใครทำร้ายให้เสียใจมา
                ขอบใจในความหวังดี
                ขอบใจที่เธอแสนดี
                แต่ว่าฉันคิดถึงเขาทุกเวลา

                เธอยังไม่ต้องถามได้ไหม
                ยังไม่ต้องถามว่าฉันรักเธอหรือไม่
                เพราะฉันแค่ไม่พร้อม เข้าใจใช่ไหม แค่ไม่พร้อมที่จะเริ่มต้นใหม่

                โปรดเห็นใจกันเถอะนะ
                ไม่อยากทำให้เธอผิดหวัง
                แค่ขอเวลาสักพัก
                ก่อนที่ใจจะรักใครได้อีกครั้ง

                แต่ติดตรงที่ฉัน
                เพิ่งโดนใครทำร้ายให้เสียใจมา
                คนที่ยังจดจำเพราะเขามีความหมายกับฉันเรื่อยมา

                อาจเพราะว่าเขาคือใครที่ใกล้เคียงคนที่ใช่
                แต่เขาดันมาจากไป
                ตอนที่ฉันให้เขาหมดใจ

                ไม่อยากเป็นคนไม่ดี
                ทำเธอรู้สึกไม่ดี
                ที่ตัวฉันยังคิดถึงเขาทุกเวลา

                เธอยังไม่ต้องถามได้ไหม
                ยังไม่ต้องถามว่าฉันรักเธอหรือไม่
                เพราะฉันแค่ไม่พร้อม เข้าใจใช่ไหม แค่ไม่พร้อมที่จะเริ่มต้นใหม่

                โปรดเห็นใจกันเถอะนะ ไม่อยากทำให้เธอผิดหวัง
                แค่ขอเวลาสักพักก่อนที่ใจจะรักใครได้อีกครั้ง

                โปรดเห็นใจกันเถอะนะ ไม่อยากทำให้เธอผิดหวัง
                แค่ขอเวลาสักพักก่อนที่ใจจะรักเธอได้

                ขอโทษที่ฉันนั้นยังไม่ลืม (ไม่ลืม) ภาพเขา
                ขอโทษที่ฉันไม่พร้อมให้ (ไม่พร้อมให้เธอเข้ามา) เธอเข้ามา
                ขอโทษที่ฉันนั้นยังไม่ลืมภาพเขา (ขอเพียง)
                ขอโทษที่ฉันไม่พร้อมให้เธอเข้ามา (ฮู้)

                เธอยังไม่ต้องถามได้ไหม
                ไม่ต้องถามว่าฉันรักเธอหรือไม่`,
        audio: '/upload/ติดตรงที่ฉัน (It’s Not You, It’s Me).mp3',
        fav: 18554
    },
    {
        nameSong: "ยังคงสวยงาม (When The Film's Over)",
        imgSong: "https://i.ytimg.com/vi/7ThDBzRLes8/maxresdefault.jpg",
        type: "pop",
        lyric: `เปรียบความรัก เรื่องเราสองคน
                เป็นเหมือนหนังเรื่องหนึ่ง
                มีทั้งซึ้ง มีทั้งเศร้าปน
                รวมเรื่องราวมากมาย

                จนถึงตอนท้ายท้าย
                (แม้รักเธอมากแค่ไหน)
                มันไปต่อไม่ได้
                (แม้พยายามเท่าไร)
                ฉันและเธอคงจบลงเท่านี้

                เก็บทุกความรู้สึกที่ดีเอาไว้
                อย่าให้หาย
                อย่าให้หาย
                หากว่าเราไม่อาจจบฉากสุดท้าย
                อย่างที่ฝัน
                เรื่องเธอและฉัน
                ก็ยังคงสวยงาม
                ยังสวยงาม

                สิ่งที่ฉันจำ
                คือถ้อยคำที่เธอคอยห่วงใย
                ไม่ลืมสายตา
                ในเวลาที่เธอคอยปลอบใจ
                ย้อนดูซ้ำๆ
                ฉากที่เรากอดกันไว้
                ไม่ลืมภาพวันที่อยู่ด้วยกัน
                วันนั้น

                แต่วันนี้ไม่มีเธอ
                (ไม่มีเราอีกต่อไป)
                ทำได้แค่คิดถึงเธอ
                (ไม่รู้ถึงเธอบ้างไหม)
                ถ้าเธอฟังฉันอยู่
                อยากให้เธอลอง

                เก็บทุกความรู้สึกที่ดีเอาไว้
                อย่าให้หาย
                อย่าให้หาย
                หากว่าเราไม่อาจจบฉากสุดท้าย
                อย่างที่ฝัน
                เรื่องเธอและฉัน
                ก็ยังคงสวยงาม
                ยังสวยงาม
                ก็ยังคงสวยงาม
                ไม่ว่านานแสนนานเท่าไหร่
                จำแค่ภาพสองเราเอาไว้
                ฉันขอแค่นี้

                แม้วันนี้ไม่มีเธออีกแล้ว
                แม้วันนี้ไม่มีเราอีกแล้ว
                ก็ไม่เป็นไร
                อู้ อู
                ความทรงจำไม่มีวันเลือนหาย
                อดีตเรายังคงมีความหมาย
                จะไม่เสียใจ
                จะไม่ร้องไห้

                เก็บทุกความรู้สึกที่ดีเอาไว้
                อย่าให้หาย
                อย่าให้หาย
                หากว่าเราไม่อาจจบฉากสุดท้าย
                อย่างที่ฝัน
                เรื่องเธอและฉัน
                ก็ยังคงสวยงาม
                ยังสวยงาม
                ฉากสุดท้ายมันจะเป็นอย่างไร
                เราทั้งสองจะคงตลอดไป
                ในใจดวงนี้`,
        audio: '/upload/ยังคงสวยงาม (When The Film’s Over).mp3',
        fav: 19662
    },
    {
        nameSong: "จากกันด้วยดี (Ordinary)",
        imgSong: "https://s.isanook.com/jo/0/rp/r/w700/ya0xa0m1w0/aHR0cDovL2ltYWdlLmpvb3guY29tL0pPT1hjb3Zlci8wLzY0NWQzOGU1ODQ1OGFkN2UvNjQwLmpwZw==.jpg",
        type: "pop",
        lyric: `เป็นธรรมดา เรื่องการอำลา
        หากเราบังเอิญ ได้พบคนที่ดีกว่า
        (พบคนที่ดีกว่า)
        
        เรื่องความสัมพันธ์ เป็นเรื่องสำคัญ
        แต่เมื่อถึงวัน ที่หมดเวลา
        ก็ต้องเลิกรา (ก็ต้องเลิกรา)
        
        เมื่อมันไม่ใช่ เราจะไม่ฝืน
        แต่ในหัวใจ เราจะไม่ลืม
        เรื่องที่ผ่านมา จากกันด้วยดี
        
        ถ้าต้องทิ้งไป เราก็จะไม่เสียใจ
        เราก็จะไม่เสียดาย
        ไม่ใช่คนรักกัน
        ไม่ได้แปลว่าเราไม่รักกัน
        เธอก็ยังมีฉันเหมือนเดิม
        
        เรื่องเธอและฉัน ที่เคยมีกัน ยังคงสวยงาม
        และความทรงจำ ของเราในตอนนั้น
        ไม่เคยเลือนลาง (ไม่เคยเลือนลาง)
        
        เราอาจต้องพราก และไม่ได้คบ
        แต่ในหัวใจ เรายังได้พบ
        เรื่องที่ผ่านมา จากกันด้วยดี
        
        ถ้าต้องทิ้งไป เราก็จะไม่เสียใจ
        เราก็จะไม่เสียดาย
        ไม่ใช่คนรักกัน
        ไม่ได้แปลว่าเราไม่รักกัน
        เธอก็ยังมีฉันเหมือนเดิม
        
        พบคนที่ดีกว่า พบคนที่เราจะรัก
        ไม่ใช่คนรักกัน ไม่ได้แปลว่าเราไม่รักกัน
        เธอก็ยังมีฉันเหมือนเดิม
        
        ถ้าต้องทิ้งไป เราก็จะไม่เสียใจ
        เราก็จะไม่เสียดาย
        ไม่ใช่คนรักกัน
        ไม่ได้แปลว่าเราไม่รักกัน
        เธอก็ยังมีฉันเหมือนเดิม
        
        พบคนที่ดีกว่า พบคนที่เราจะรัก
        ไม่ใช่คนรักกัน ไม่ได้แปลว่าเราไม่รักกัน
        เธอก็ยังมีฉันเหมือนเดิม
        
        พบคนที่ดีกว่า พบคนที่เราจะรัก
        ไม่ใช่คนรักกัน ไม่ได้แปลว่าเราไม่รักกัน
        เธอก็ยังมีฉันเหมือนเดิม`,
        audio: '/upload/จากกันด้วยดี (Ordinary).mp3',
        fav: 18945
    },
    {
        nameSong: "เดอะแบก (Baggage)",
        imgSong: "https://i.ytimg.com/vi/vgxPafRApsU/maxresdefault.jpg",
        type: "pop",
        lyric: `หนักเหมือนกันนะ แบกความสัมพันธ์เอาไว้
        เหนื่อยเหมือนกันไหม เพราะว่าฉันเริ่มจะไม่ไหว
        
        เราทะเลาะกันทุกเวลา
        รอยยิ้มเริ่มกลายเป็นน้ำตา
        ทุกๆ วันก็มีแต่ปัญหา
        และ มีแค่ฉัน แค่ฉัน ที่พยายามจะ
        
        แบกไว้ แบกไว้
        แม้ว่าข้างใน แทบไม่ไหว ไม่ไหวเลย
        หัวใจที่มี ก็แหลกไป แหลกไป
        รักเรามันไม่เป็นอย่างที่เคย
        
        ใจมันขอร้องให้ฉันพอ
        เพราะเธอไม่พร้อมที่จะไปต่อ
        แขนยังคงแบก แต่หัวใจแทบแหลก
        อยากปล่อยและวางรักลงสักที
        
        ได้แต่ประคองไม่ให้พัง
        เพราะใจของฉันยัง อยากให้เราไปด้วยกัน
        แขนยังคงแบก แต่หัวใจแทบแหลก
        อยากปล่อยและวางรักลง วางรักลงสักที
        
        ขอแค่นี้ เราคุยกันได้ไหม
        เธอชอบวิ่งหนี และทิ้งฉันเอาไว้
        
        เลิกกันเป็นพันครั้ง
        และในทุกๆ ครั้ง ก็มีเพียงแค่ฉัน
        ที่ยังคงมีความหวัง
        ให้เราเริ่มใหม่อีกครั้ง
        ฉันเลย
        
        แบกไว้ แบกไว้
        แม้ว่าข้างใน แทบไม่ไหว ไม่ไหวเลย
        หัวใจที่มี ก็แหลกไป แหลกไป
        รักเรามันไม่เป็นอย่างที่เคย
        
        ใจมันขอร้องให้ฉันพอ
        เพราะเธอไม่พร้อมที่จะไปต่อ
        แขนยังคงแบก แต่หัวใจแทบแหลก
        อยากปล่อยและวางรักลงสักที
        
        ได้แต่ประคองไม่ให้พัง
        เพราะใจของฉันยัง อยากให้เราไปด้วยกัน
        แขนยังคงแบก แต่หัวใจแทบแหลก
        อยากปล่อยและวางรักลง วางรักลง
        
        พอแล้วสักที มันไม่มีความหมาย
        ยอมรับสักที เราไม่มีความหมาย
        ถ้ามันพังแล้ว แบกไว้เพื่ออะไร
        
        พอแล้วสักที หยุดทำดีได้แล้ว
        ยอมรับสักที มันไม่ดีขึ้นแล้ว
        แค่ทิ้งใจไป วางรักลงได้ไหม
        
        แบกไว้ แบกไว้
        แบกไว้ แบกไว้
        แบกไว้ แบกไว้
        แบกไว้ แบกไว้
        
        ใจมันขอร้องให้ฉันพอ
        เพราะเธอไม่พร้อมที่จะไปต่อ
        แขนยังคงแบก แต่หัวใจแทบแหลก
        อยากปล่อยและวางรักลงสักที
        
        ได้แต่ประคองไม่ให้พัง
        แต่ต้องยอมรับมัน เมื่อเราถึงทางตัน
        ไม่ต้องไปแบก ให้หัวใจมันแหลก
        ต้องปล่อยและวางรักลง วางรักลง สักที`,
        audio: '/upload/เดอะแบก (Baggage).mp3',
        fav: 20214
    },
    {
        nameSong: "ลู่วิ่ง (Can’t Keep Up)",
        imgSong: "https://storage.thaipost.net/main/uploads2/photos/big/20210804/image_big_610a260ea4a56.jpg",
        type: "pop",
        lyric: `(เพราะตอนนี้ ฉันวิ่งตามเธอไม่ทัน)
        (เพราะตอนนี้ ฉันวิ่งตาม ตาม ตาม)
        
        วิ่งตามเธออย่างนี้ มันเหนื่อยรู้ไหม
        เธอลองมาเป็นฉันไหมสลับกันดู
        ต้องแพ้ให้เธออย่างนี้ ไปอีกนานแค่ไหน
        ถ้ารู้สึกมากกว่าที่เธอมี ฉันก็คงแพ้ไป
        
        วิ่ง วิ่ง อยู่อย่างนี้ วิ่ง วิ่ง อยู่กับที่
        ไม่ไปไหน ไม่ไปไหน
        วิ่งตามเธออย่างนี้ นิ่งเฉยอยู่กับที่
        อีกไกลไหม จะไปถึง
        
        พยายามวิ่งตามเท่าไร
        เร็วแค่ไหน แค่ไหน ก็ไกล
        เพราะฉันยังวิ่งตามไม่ทันเธอเลยสักครั้ง
        บอกได้ไหม ต้องทำเช่นไร
        ฉันสงสัย ฉันไม่เข้าใจ
        เหมือนดิ้นรนวิ่งบนลู่วิ่งยังไงยังงั้น
        
        เธอช่วยรอกันหน่อย ยืนอยู่กับที่ได้ไหม
        ข้างหลังเธอยังมีใคร ที่ยังไปไม่ถึงไหน
        ถามเธอสักคำหน่อย เธอเคยคิดถึงฉันไหม
        ถ้าเธอมีใจให้ฉันก็หันมาหน่อย
        เพราะตอนนี้ฉันวิ่งตามเธอไม่ทัน
        
        อยากที่จะเลิกวิ่งมาตั้งหลายครั้ง
        แต่เธอก็ทำให้ฉันเริ่มใหม่ทุกครั้ง
        พอฉันจะหยุด เธอก็ฉุดไม่ให้ไป
        เธอขอให้อยู่ เพื่อให้เธอสบายใจ
        สุดท้ายไม่ได้ข้างกัน แต่ฉันก็ยังยินดีที่จะต้อง
        
        วิ่ง วิ่ง อยู่อย่างนี้ วิ่ง วิ่ง อยู่กับที่
        ไม่ไปไหน ไม่ไปไหน
        วิ่งตามเธออย่างนี้ นิ่งเฉยอยู่กับที่
        อีกไกลไหม จะไปถึง
        
        พยายามวิ่งตามเท่าไร
        เร็วแค่ไหน แค่ไหน ก็ไกล
        เพราะฉันยังวิ่งตามไม่ทันเธอเลยสักครั้ง
        บอกได้ไหม ต้องทำเช่นไร
        ฉันสงสัย ฉันไม่เข้าใจ
        เหมือนดิ้นรนวิ่งบนลู่วิ่งยังไงยังงั้น
        
        เธอช่วยรอกันหน่อย ยืนอยู่กับที่ได้ไหม
        ข้างหลังเธอยังมีใคร ที่ยังไปไม่ถึงไหน
        ถามเธอสักคำหน่อย เธอเคยคิดถึงฉันไหม
        ถ้าเธอมีใจให้ฉันก็หันมาหน่อย
        เพราะตอนนี้ฉันวิ่งตามเธอไม่ทัน
        
        เธอช่วยรอกันหน่อย ยืนอยู่กับที่ได้ไหม
        เหนื่อยล้ามานานเท่าไร ก็ยังไปไม่ถึงไหน
        ถามเธอสักคำหน่อย เธอเคยคิดถึงฉันไหม
        ถ้าเธอมีใจให้ฉันก็หันมาหน่อย
        เพราะตอนนี้ฉันวิ่งตามเธอไม่ทัน
        
        (เพราะตอนนี้ฉันวิ่งตามเธอไม่ทัน)
        (เพราะตอนนี้ฉันวิ่งตามเธอไม่ทัน)
        (เพราะตอนนี้ฉันวิ่งตามเธอไม่ทัน)
        (เพราะตอนนี้ฉันวิ่งตามเธอไม่ทัน)
        วิ่ง วิ่ง
        
        (เพราะตอนนี้ฉันวิ่งตามเธอไม่ทัน)
        วิ่ง วิ่ง
        (เพราะตอนนี้ฉันวิ่งตามเธอไม่ทัน)
        วิ่ง วิ่ง
        (เพราะตอนนี้ฉันวิ่งตามเธอไม่ทัน)
        วิ่ง วิ่ง
        เพราะตอนนี้ฉันวิ่งตามเธอไม่ทัน`,
        audio: '/upload/ลู่วิ่ง (Can’t Keep Up).mp3',
        fav: 19984
    },
    {
        nameSong: "อยู่ได้ ได้อยู่ (ineednoone)",
        imgSong: "https://is3-ssl.mzstatic.com/image/thumb/Music113/v4/2d/6b/5f/2d6b5f74-e989-e41b-fadd-b84102c4bdac/1909234901.jpg/1200x1200bf-60.jpg",
        type: "rap",
        lyric: `เจอมากี่ครั้งเรื่องรักๆ เดี๋ยวจะเล่าให้ฟัง
        ชอบคนไหน ไม่ว่าใคร เขาก็ไม่ชอบกลับ
        ใครมารัก เราก็มักที่จะไม่รักตอบ (สักครั้ง)
        หัวใจมันบอบช้ำ
        
        เจอมากี่ที ดูเหมือนจะดี แต่ก็โดนเททุกที
        คงต้องเข้าใจ คนที่ไม่ใช่ ก็คือไม่ใช่ แค่นี้
        อีกกี่ครั้ง ที่ผิดหวัง ทำให้เรา ต้องมาเจ็บอยู่ดี
        แล้วจะทำไม
        
        ไม่ต้องมีใคร อยู่ได้ ได้อยู่
        ให้ฉันเหงาตาย มันก็ดี กว่ามีใคร
        แต่ไม่ได้เรื่องสักอย่าง
        
        เคว้งคว้างแล้วไง อยู่ได้ ได้อยู่
        ให้มันรู้ไป บอกตัวเอง
        อีกสักครั้ง ยังอยู่ได้อยู่
        
        รู้ตัว ว่าต้องเลือกสิ่งไหน หัวใจไม่เคยฟังสักครั้ง
        รู้ว่า อะไรที่สำคัญ แต่ไม่เคยเรียนรู้เลย
        
        เจ็บมากี่ครา บ่อยจนชินชา
        ไม่เป็นไรนะ ให้เจ็บกว่านี้ก็ไหว
        อาจไม่เจอรักแท้ แต่คนที่อ่อนแอ
        และไอ้ขี้แพ้ จะไม่ใช่เราอีกต่อไป
        
        เจอมากี่ที ดูเหมือนจะดี แต่ก็โดนเททุกที
        คงต้องเข้าใจ คนที่ไม่ใช่ ก็คือไม่ใช่ แค่นี้
        อีกกี่ครั้ง ที่ผิดหวัง ทำให้เรา ต้องมาเจ็บอยู่ดี
        แล้วจะทำไม
        
        ไม่ต้องมีใคร อยู่ได้ ได้อยู่
        ให้ฉันเหงาตาย มันก็ดี กว่ามีใคร
        แต่ไม่ได้เรื่องสักอย่าง
        
        เคว้งคว้างแล้วไง อยู่ได้ ได้อยู่
        ให้มันรู้ไป บอกตัวเอง อีกสักครั้ง ยังอยู่ได้อยู่
        
        (ไม่ต้องมีใคร อยู่ได้ ได้อยู่
        ให้ฉันเหงาตาย มันก็ดี กว่ามีใคร
        แต่ไม่ได้เรื่องสักอย่าง)
        
        เคว้งคว้างแล้วไง อยู่ได้ ได้อยู่
        ให้มันรู้ไป บอกตัวเอง อีกสักครั้ง ยังอยู่ได้อยู่
        
        ไม่ต้องมีใคร อยู่ได้ ได้อยู่
        ให้ฉันเหงาตาย มันก็ดี กว่ามีใคร
        แต่ไม่ได้เรื่องสักอย่าง
        
        เคว้งคว้างแล้วไง อยู่ได้ ได้อยู่
        ให้มันรู้ไป บอกตัวเอง (บอกตัวเอง)
        อีกสักครั้ง (อีกสักครั้ง)
        
        ยังอยู่ได้อยู่
        
        ยังอยู่ได้อยู่
        
        ยังอยู่ได้อยู่`,
        audio: '/upload/อยู่ได้ ได้อยู่ (ineednoone).mp3',
        fav: 16548
    },
    {
        nameSong: "ไม่รู้สึก (Unspoken)",
        imgSong: "https://i.ytimg.com/vi/cMeq4dVkKIY/maxresdefault.jpg",
        type: "r&b",
        lyric: `เธอห้ามดวงอาทิตย์
        ไม่ให้ส่องแสงไม่ได้
        เธอห้ามฝนบนฟ้า
        ไม่ให้โปรยลงมาไม่ได้
        
        ก็เหมือนความรู้สึกฉัน ที่เธอพยายาม
        ที่เธอพยายาม จะห้ามมัน
        เธอจะบังคับ ให้ฉันฝืนไปทำไม
        ฝืนได้ยังไง ก็เพราะมัน
        
        มันเป็นไปไม่ได้ ที่จะไม่รู้สึก 
        ไม่รู้สึก คิดถึงเธอ
        เธอทำไม่ได้ มาห้ามหัวใจ
        ฝืนหัวใจ ฉันไม่ยอม
        เป็นไปไม่ได้
        
        เธอห้ามท้องฟ้า เธอห้ามนิทรา
        เธอห้ามดวงดาว เธอทำไม่ได้
        เธอห้ามน้ำตา ไม่ให้ไหลลงมา
        จากตาฉัน เธอทำไม่ได้
        
        มันเป็นไปไม่ได้ ที่จะไม่รู้สึก 
        ไม่รู้สึก คิดถึงเธอ
        เธอทำไม่ได้ มาห้ามหัวใจ
        ฝืนหัวใจ ฉันไม่ยอม
        
        มันเป็นไปไม่ได้ ที่จะไม่รู้สึก 
        ไม่รู้สึก คิดถึงเธอ
        เธอทำไม่ได้ มาห้ามหัวใจ
        ฝืนหัวใจ ฉันไม่ยอม
        เป็นไปไม่ได้`,
        audio: '/upload/ไม่รู้สึก (Unspoken).mp3',
        fav: 15642
    }
];

const songNont = [
    {
        nameSong: "พิง (เพลงประกอบละคร กระเช้าสีดา)",
        imgSong: "https://s.isanook.com/jo/0/rp/r/w728/ya0xa0m1w0/aHR0cHM6Ly9zLmlzYW5vb2suY29tL2pvLzAvdWQvNDg3LzI0Mzc2MDUvYWFhLmpwZw==.jpg",
        type: "pop",
        lyric: `มองมาที่ฉัน สักหน่อยได้ไหม
                ปล่อยให้ฉันได้เช็ดน้ำตาให้เธอ
                และปล่อยให้ใจของเธอได้ลืมได้ไหม

                เรื่องราววันนั้นที่มันทำร้าย
                ขอให้ฉันได้ลบมันได้ไหม
                ใช้หัวใจของฉันเยียวยาให้เธอ

                มันคงไม่แฟร์ ถ้าเรื่องของเขา
                จะทำให้เราไม่ได้ไปต่อ
                โปรดจงเชื่อฉัน ได้ไหม

                อยากให้เธอลองรัก
                เหมือนครั้งแรกที่เธอได้พบรัก
                และลืมทุก ๆ อย่าง
                มองฉันที่หัวใจ ลองรักด้วยหัวใจ
                ไม่ต้องกลัวหรอกนะเธอ
                รักฉัน เหมือนเธอไม่เคยเจ็บสักครั้ง
                และรู้เอาไว้ว่า
                คนที่ยืนข้างเธอ เกิดมาเพื่อจะรักเธอ
                ไม่มีวันทำเธอเสียใจ

                อาจเป็นเพียงครั้งแรกที่เธอมองฉัน
                แต่เธอรู้ไหมไม่มีสักวัน
                ที่ตัวฉันไม่ได้มองมาที่เธอ
                จะเป็นคนที่ยืนข้าง ๆ เสมอ
                จะเป็นคนที่เธอหันมาก็เจอ
                มีไหล่ให้เธอพิงเมื่อเธอต้องการ

                มันคงไม่แฟร์ ถ้าเรื่องของเขา
                จะทำให้เราไม่ได้ไปต่อ
                โปรดจงเชื่อฉัน ได้ไหม

                อยากให้เธอลองรัก
                เหมือนครั้งแรกที่เธอได้พบรัก
                และลืมทุก ๆ อย่าง
                มองฉันที่หัวใจ ลองรักด้วยหัวใจ
                ไม่ต้องกลัวหรอกนะเธอ
                รักฉัน เหมือนเธอไม่เคยเจ็บสักครั้ง
                และรู้เอาไว้ว่า
                คนที่ยืนข้างเธอ เกิดมาเพื่อจะรักเธอ
                ไม่มีวันทำเธอเสียใจ

                อยากให้เธอลองรัก
                เหมือนครั้งแรกที่เธอได้พบรัก
                และลืมทุก ๆ อย่าง
                มองฉันที่หัวใจ ลองรักด้วยหัวใจ
                ไม่ต้องกลัวหรอกนะเธอ
                รักฉัน เหมือนเธอไม่เคยเจ็บสักครั้ง
                และรู้เอาไว้ว่า
                คนที่ยืนข้างเธอ เกิดมาเพื่อจะรักเธอ
                ไม่มีวันทำเธอเสียใจ`,
        audio: '/upload/พิง (เพลงจากละครกระเช้าสีดา).mp3',
        fav: 23655
    },
    {
        nameSong: "มีผลต่อหัวใจ",
        imgSong: "https://c-cl.cdn.smule.com/rs-s90/arr/86/29/bb0fcf62-04d4-44cb-a221-a5a7bdfdac90_1024.jpg",
        type: "pop",
        lyric: `บางอย่างก็ไม่เปลี่ยนไป
                แม้อะไรอะไรจะเปลี่ยน ฮื้มฮือ
                บางสิ่งก็คล้ายบทเรียน
                ที่ฉันไม่เคยผ่านมันได้เลยซ้ำซ้ำ ฮืม (ฮู้ว ฮ่า)

                แค่วันนี้ได้สบสายตา
                แค่พูดคุยกันไม่กี่คำ
                ต่อให้เฝ้าระวัง
                ให้ยั้งยังไง
                ก็พลั้งพลาดไปทุกที
                เคยคิดเวลาจะช่วยทำใจ
                ให้ฉันลืมเธอคนนี้
                แต่แล้วอาการเดิมเดิมก็กลับมา

                สุดท้ายฉันก็พ่ายแพ้
                แพ้ให้ใจตัวเองที่ไม่เคยหยุดรักเธอ
                สุดท้ายฉันยังรอคอยเธอเสมอ
                แม้จะเนิ่นนานสักเพียงไหน
                เธอยังคงมีผลต่อหัวใจ
                ไม่หายรักเธอได้สักที

                ฮื้มฮือ
                ทำไมยังรู้สึกดี
                ทั้งที่เธอไม่เคยมีใจ (ฮื้อฮืม)
                ทำไมยังรู้สึกหวั่นไหว
                ทั้งทั้งที่รู้แก่ใจเป็นไปไม่ได้ โอ้ว ฮืม ฮืม

                แค่วันนี้ได้สบสายตา
                แค่พูดคุยกันไม่กี่คำ
                ต่อให้เฝ้าระวัง
                ให้ยั้งยังไง
                ก็พลั้งพลาดไปทุกที
                เคยคิดเวลาจะช่วยทำใจ
                ให้ฉันลืมเธอคนนี้
                แต่แล้วอาการเดิมเดิมก็กลับมา

                สุดท้ายฉันก็พ่ายแพ้
                แพ้ให้ใจตัวเองที่ไม่เคยหยุดรักเธอ
                สุดท้ายฉันยังรอคอยเธอเสมอ
                แม้จะเนิ่นนานสักเพียงไหน
                เธอยังคงมีผลต่อหัวใจ
                ไม่หายรักเธอได้สักที

                สมองไม่เคยมีแรงจะสั่งหัวใจ
                ไม่มีปาฏิหาริย์ไหนพอจะทำให้เปลี่ยนไป
                ไกลเกินจากฝัน
                เธอเกินเอื้อมมือฉัน
                เป็นได้เพียงแค่เพื่อนกันแค่เท่านั้น
                แค่เท่านั้น

                สุดท้ายฉันก็พ่ายแพ้
                แพ้ให้ใจตัวเองที่ไม่เคยหยุดรักเธอ
                สุดท้ายฉันยังรอคอยเธอเสมอ
                แม้จะเนิ่นนานสักเพียงไหน
                เธอยังคงมีผลต่อหัวใจ

                และฉันเองก็พ่ายแพ้
                แพ้ให้ใจตัวเองที่ไม่เคยหยุดรักเธอ
                สุดท้ายฉันยังรอคอยเธอเสมอ
                แม้จะเนิ่นนานสักเพียงไหน
                เธอยังคงมีผลต่อหัวใจ
                ไม่หายรักเธอได้สักที

                รู้ว่าควรจะพอแต่ก็ทำไม่ไหว
                รู้ว่าควรจะพอแต่ก็ทำไม่ได้ เฮ
                ให้ทำอย่างไร
                รู้ว่าควรจะพอแต่ก็ทำไม่ไหว
                รู้ว่าควรจะพอแต่ก็ทำไม่ได้
                ก็ใจ`,
        audio: '/upload/มีผลต่อหัวใจ.mp3',
        fav: 25045
    },
    {
        nameSong: "ฝืนตัวเองไม่เป็น",
        imgSong: "https://i.scdn.co/image/ab67616d0000b273d59b546e0df17a641b1801c2",
        type: "pop",
        lyric: `ขอให้เธอรับฟังได้ไหม
                หากปล่อยทิ้งไว้นานไป
                มันก็ไม่ดีกว่านี้

                เธออย่าห้ามฉันเลยได้ไหม
                ปล่อยให้ฉันนั้นเป็นไป
                หยุดรักเธอไม่ได้แล้ว

                เข้าใจทุกอย่างที่เธอบอกนะ
                เข้าใจทุกสิ่งที่เธอกำลังจะอธิบาย
                เข้าใจเสมอ

                แต่จะให้ฉันให้ฉันทำอย่างไร
                ฉันรักเธอแล้วทั้งใจ
                จะไม่ให้รักไม่ให้รักได้อย่างไร
                ฉันฝืนตัวเองไม่เป็น
                ไม่ได้อยากจะกวนใจ
                อยากถามเธอสักคำหน่อย
                หากว่าเธอรักใครสักคน
                เธอฝืนใจได้หรือเปล่า

                ฉันไม่อยากซ่อนใจอีกแล้ว
                เจ็บยังไงก็ต้องเสี่ยง
                ดีกว่าทนเก็บเอาไว้
                เข้าใจทุกอย่างที่เธอบอกนะ
                เข้าใจทุกสิ่งที่เธอกำลังจะอธิบาย
                เข้าใจเสมอ

                แต่จะให้ฉันให้ฉันทำอย่างไร
                ฉันรักเธอแล้วทั้งใจ
                จะไม่ให้รักไม่ให้รักได้อย่างไร
                ฉันฝืนตัวเองไม่เป็น
                ไม่ได้อยากจะกวนใจ
                อยากถามเธอสักคำหน่อย
                หากว่าเธอรักใครสักคน
                เธอฝืนใจได้หรือเปล่า

                ฉันรู้ฉันเป็นแค่คนไกล
                ไม่ใกล้ใจเธอเลย
                ฉันรู้ตัวดีถึงฉันบอกรัก
                เธอก็อาจเมินเฉย
                บอกเธอว่ารักก็ต้องเจ็บ
                เก็บไว้ยังไงก็ยิ่งเจ็บ
                มองแล้วไม่เห็นจะมีทางไหน

                แต่จะให้ฉันให้ฉันทำอย่างไร
                ฉันรักเธอแล้วทั้งใจ
                จะไม่ให้รักไม่ให้รักได้อย่างไร
                ฉันฝืนตัวเองไม่เป็น
                ไม่ได้อยากจะกวนใจ
                อยากถามเธอสักคำหน่อย
                หากว่าเธอรักใครสักคน
                เธอฝืนใจได้หรือเปล่า

                ไม่ได้อยากจะกวนใจ
                อยากถามเธอสักคำหน่อยได้ไหม
                เวลาเธอรักใคร
                เธอห้ามใจได้ไหมเธอ

                เธอจะรักไม่รักมันก็ไม่รู้
                จะเก็บไว้ในใจมันก็ไม่อยู่
                อย่างเดียวที่รู้คือทนต่อไปไม่ไหว
                เธอจะรักไม่รักมันก็ไม่รู้
                จะเก็บไว้ในใจมันก็ไม่อยู่
                ก็เลยต้องถามเธอดูให้รู้ใจ

                เธอจะรักไม่รักมันก็ไม่รู้
                จะเก็บไว้ในใจมันก็ไม่อยู่
                อย่างเดียวที่รู้คือทนต่อไปไม่ไหว
                เธอจะรักไม่รักมันก็ไม่รู้
                จะเก็บไว้ในใจมันก็ไม่อยู่
                ก็เลยต้องถามเธอดูให้รู้ใจ`,
        audio: '/upload/ฝืนตัวเองไม่เป็น.mp3',
        fav: 23654
    },
    {
        nameSong: "ความรักกำลังก่อตัว",
        imgSong: "https://i.ytimg.com/vi/axAI44Xa1qQ/maxresdefault.jpg",
        type: "pop",
        lyric: `ฮู้ว เฮ้เอ
                เพียงได้คุยเพียงได้สบสายตา
                วันเวลาอันตรธานหายไป
                ทุกอย่างต้องหยุดทันทีเมื่อฉันพบเธอ
                ชัดแค่เธอ ทุกอย่างเบลอจากใจ

                Ah เจอกี่ครั้งที่เราได้ใกล้กัน
                เธอและฉันเหมือนมีแรงฉุดไว้
                แต่ไม่มีใครยอมจะพูดคำลา
                คล้ายว่ามันจะเป็นวันสุดท้าย

                อาจเป็นเธอและฉันนั้น Fall in love baby
                มีอะไรเชื่อมเราบางอย่าง Ah
                ทีละเล็กละน้อย ค่อยค่อยเป็นภาพลางลาง
                บวกความรักนั้นกำลังก่อตัว
                อยู่ในใจฉันและเธอเข้าแล้ว

                เก็บความรู้สึกไว้สักวันก็คงได้บอก
                รักเธอ
                คงไม่นานคงจะมีเวลาดีดีให้สองเรา
                You will be my love

                ฮู้วโว้ ฮูโอ้

                จะกี่ครั้งที่เราได้พูดคุย
                เหมือนว่าเราไม่พบกันนานแค่ไหน
                ไม่อยากจะหยุดฟังเสียงของเธอ
                เพราะเธอเหมือนเสียงเพลงที่ถูกใจ

                ฉันอยากรู้เมื่อไรความรักนั้น
                จะทำฉันและเธอทนไม่ไหว
                อยากบอกให้เธอฟังให้รู้กันไป
                เดี๋ยวนานกลัวเธอจะเปลี่ยนใจ

                เฮ้อ อาจเป็นเธอและฉันนั้น Fall in love baby
                มีอะไรเชื่อมเราบางอย่าง เฮ้เย่
                ทีละเล็กละน้อยค่อยค่อยเป็นภาพลางลาง
                บวกความรักนั้นกำลังก่อตัว
                อยู่ในใจฉันและเธอเข้าแล้ว

                เก็บความรู้สึกไว้สักวันก็คงได้บอก
                รักเธอ
                คงไม่นานคงจะมีเวลาดีดีให้สองเรา
                You will be my love

                เก็บความรู้สึกไว้สักวันก็คงได้บอก
                รักเธอ
                คงไม่นานคงจะมีเวลาดีดีให้สองเรา
                You will be my love baby

                You know you make me feel brand new ฮู้ฮูฮู (make me feel brand new my love)
                อยากให้ไปถึงวันที่สองเรา (ฮู้วูฮู้)
                รักกัน ฮู้วูฮู้

                เก็บความรู้สึกไว้สักวันก็คงได้บอก (ฮู้วูฮู้)
                รักเธอ (Alright)
                คงไม่นานคงจะมีเวลาดีดีให้สองเรา
                Will you be my love baby

                เก็บความรู้สึกไว้สักวันก็คงได้บอก (โฮ้)
                รักเธอ (โอ้ว รักเธอ รักเธอ Baby)
                คงไม่นานคงจะมีเวลาดีดีให้สองเรา (Woo)
                You will be my love baby

                เก็บความรู้สึกไว้สักวันก็คงได้บอก (โน่โฮ้)
                รักเธอ
                คงไม่นานคงจะมีเวลาดีดีให้สองเรา (โฮ้โน่ว)(ฮู้วูฮู้)
                You will be my love baby Ah`,
        audio: '/upload/ความรักกำลังก่อตัว.mp3',
        fav: 24567
    },
    {
        nameSong: "เปลี่ยนเป็นรัก Ost.รักต้องอุ้ม",
        imgSong: "https://i.scdn.co/image/ab67616d0000b273e57fb22154558e977f7a141e",
        type: "pop",
        lyric: `เลิกดีกว่า ก็เลิกเสียดีกว่า
                ที่ได้คบมาแบบเพื่อนก็น่าจะพอ
                เห็นเห็นกันอยู่
                รู้ว่าเธอเองก็รอ
                ใช่หรือเปล่า

                พอจะมีแนวทางเหมือนกันไหม
                ใจของฉันและเธอตรงกันไหม

                เปลี่ยนเป็นรักกันได้ไหมเธอ
                เปลี่ยนให้ฉันเป็นแฟนเธอได้หรือเปล่า
                ไม่อยากเดินเหงาเหงา
                มีเธอแล้วมันอุ่นหัวใจ

                เปลี่ยนเป็นคู่ใจกันดีกว่า
                อยากเป็นมากกว่าเพื่อนโอเคไหม
                เธอยินดีเมื่อไร
                แค่ส่งสัญญาณมาก็พอ

                คิดดูก่อน ก็คิดให้ดีก่อน
                ถ้าไม่สะดวกตอนนี้มัดจำไว้ก่อน
                ไม่ต้องรีบหรอก
                ฉันนั้นยินดีจะรอ
                ขอให้บอก

                พอจะมีแนวทางเหมือนกันไหม
                ใจของฉันและเธอตรงกันไหม

                เปลี่ยนเป็นรักกันได้ไหมเธอ
                เปลี่ยนให้ฉันเป็นแฟนเธอได้หรือเปล่า
                ไม่อยากเดินเหงาเหงา
                มีเธอแล้วมันอุ่นหัวใจ

                เปลี่ยนเป็นคู่ใจกันดีกว่า
                อยากเป็นมากกว่าเพื่อนโอเคไหม
                เธอยินดีเมื่อไหร่
                แค่ส่งสัญญาณมาก็พอ

                พอจะมีแนวทางเหมือนกันไหม
                ใจของฉันและเธอตรงกันไหม

                เปลี่ยนเป็นรักกันได้ไหมเธอ
                เปลี่ยนให้ฉันเป็นแฟนเธอได้หรือเปล่า
                ไม่อยากเดินเหงาเหงา
                มีเธอแล้วมันอุ่นหัวใจ

                เปลี่ยนเป็นคู่ใจกันดีกว่า
                อยากเป็นมากกว่าเพื่อนโอเคไหม
                เธอยินดีเมื่อไร
                แค่ส่งสัญญาณมาก็พอ

                เธอโอเคเมื่อไร
                มองตานิดนึง
                บอกรักเลยก็ดี`,
        audio: '/upload/เปลี่ยนเป็นรัก.mp3',
        fav: 22554
    },
    {
        nameSong: "วันครบเลิก (UNNIVERSARY)",
        imgSong: "https://i.ytimg.com/vi/f2KamJwJqmc/maxresdefault.jpg",
        type: "pop",
        lyric: `วันเดิมที่วนกลับมา
                คือวันครบปีที่เรานั้นรักกัน

                กลายเป็นวันธรรมดา
                ไม่มีแม้เงาของเราสองคน

                เพลงเดิมที่ฟังประจำ
                มีคำว่าเธอกับฉัน
                จะรักกันเรื่อยไป
                กลายเป็นเพลงที่ทำให้ฉัน
                ต้องมีน้ำตาทุกครั้ง
                ยังคงรอเธอ
                ให้กลับมาเจอ
                You my whole world
                Oh, girl

                และในวันนี้ ไปยืนที่เก่า
                ตรงที่เคยมีสองเรา
                เคยจับมือและก็บอกรักกัน
                Oh, you are my love
                รอบตัวก็ดูเหมือนเดิม
                แต่ต้องยอมรับว่าเรื่องที่เปลี่ยน
                นั้นก็คือ

                ไม่มีเธอยืนอยู่อีกแล้ว
                ไม่มีอ้อมกอดที่คุ้นเคย
                ยืนอยู่เฉย ๆ
                น้ำตา ก็เริ่มไหลมา
                มีคำถามที่ฉันนั้นค้างคา
                เธอคิดจะกลับ
                มาบ้างหรือเปล่า
                ในใจยังมี
                ความคิดถึงเหมือนกันบ้างหรือเปล่า

                ดูหนังเรื่องเดิมอีกแล้ว
                เรื่องที่เราสองคนเคยดูมันด้วยกัน
                และซีนนี้ที่ตัวละครตัวเอกต้องลาจากกันไป
                ไม่เคยคิดเลยว่าชีวิตจะโดนแบบเรื่องที่ดู
                อยู่ตรงนี้ alone ต้องทนมันทุกที
                
                แต่ในวันนี้ ไปยืนที่เก่า
                ตรงที่เคยมีสองเรา
                เคยจับมือและก็บอกรักกัน
                Oh, you are my love
                รอบตัวก็ดูเหมือนเดิม
                แต่ต้องยอมรับว่าเรื่องที่เปลี่ยน
                นั้นก็คือ
                
                ไม่มีเธอยืนอยู่อีกแล้ว
                ไม่มีอ้อมกอดที่คุ้นเคย
                ยืนอยู่เฉย ๆ
                น้ำตา ก็เริ่มไหลมา
                มีคำถามที่ฉันนั้นค้างคา
                เธอคิดจะกลับ
                มาบ้างหรือเปล่า
                ในใจยังมี
                ความคิดถึงเหมือนกันบ้างหรือเปล่า

                ไม่มีเธอยืนอยู่อีกแล้ว
                ไม่มีอ้อมกอดที่คุ้นเคย
                ยืนอยู่เฉย ๆ
                น้ำตา ก็เริ่มไหลมา
                มีคำถามที่ฉันนั้นค้างคา
                เธอคิดจะกลับ
                มาบ้างไหม

                ไม่มีเธอยืนอยู่อีกแล้ว
                ไม่มีอ้อมกอดที่คุ้นเคย
                ยืนอยู่เฉย ๆ
                น้ำตา ก็เริ่มไหลมา
                มีคำถามที่ฉันนั้นค้างคา
                เธอคิดจะกลับ
                มาบ้างหรือเปล่า
                เธอคิดจะกลับ
                มาบ้างไหม (Oh, baby)

                ในใจยังมี
                ความคิดถึงเหมือนกันบ้างหรือเปล่า`,
        audio: '/upload/วันครบเลิก (UNNIVERSARY).mp3',
        fav: 21456
    }
];

const songToys = [
    {
        nameSong: "ก่อนฤดูฝน (Before rain)",
        imgSong: "https://s.isanook.com/jo/0/ud/477/2387861/1(1)_1.jpg",
        type: "rap",
        lyric: `เพียงแค่ฝนตกลงที่หน้าต่างในบางครา
                เพียงแค่ฝนตกลงในวันหยุดในตอนเช้า
                มันก็อาจจะมีนิดเดียวที่คิดถึงเธอ
                มันก็อาจจะเป็นครั้งเดียวที่บอกรักเธอ

                เพียงแค่ฉันเองก็ไม่รู้ว่าในทุกๆวันที่มีแต่เธอ
                ยังคงละเมอและเพ้อทุกครั้งที่มองขึ้นไป
                บนท้องฟ้าหยดน้ำค้างตกกระทบในตาฉัน
                แล้วในวันนี้พรุ่งนี้จะเป็นยังไงจะเดินจะกิน
                จะนอนจนวันนึงให้วันเวลาเดินไปเท่าไร
                แต่สุดท้ายแดดยามเช้าก็ไม่สดใส

                เพียงแค่ฝนตกลงที่หน้าต่างในบางครา
                เพียงแค่ฝนตกลงในวันหยุดในตอนเช้า
                มันก็อาจจะมีนิดเดียวที่คิดถึงเธอ
                มันก็อาจจะเป็นครั้งเดียวที่บอกรักเธอ

                แต่สุดท้ายกาลเวลาก็บอกฉัน
                ว่าเธอนั้นไม่ใช่ทุกอย่างและฉันก็ไม่ต้องการ
                เธอในตอนนี้ก็มีแค่เพียงฝน
                มาอยู่กับฉันมาแทนที่เธอในวันที่ฉันต้องการแค่

                เพียงแค่ฝนตกลงที่หน้าต่างในบางครา
                เพียงแค่ฝนตกลงในวันหยุดในตอนเช้า
                มันก็อาจจะมีนิดเดียวที่คิดถึงเธอ
                มันก็อาจจะเป็นครั้งเดียวที่บอกรักเธอ

                เพียงแค่ฝนตกลงที่หน้าต่างในบางครา
                เพียงแค่ฝนตกลงในวันหยุดในตอนเช้า
                มันก็อาจจะมีนิดเดียวที่คิดถึงเธอ
                มันก็อาจจะเป็นครั้งเดียวที่บอกรักเธอ`,
        audio: '/upload/ก่อนฤดูฝน(Before rain).mp3',
        fav: 26000
    },
    {
        nameSong: "จดหมาย",
        imgSong: "https://s.isanook.com/jo/0/rp/r/w700/ya0xa0m1w0/aHR0cHM6Ly9qb294LWNtcy1pbWFnZS0xMjUxMzE2MTYxLmZpbGUubXlxY2xvdWQuY29tLzIwMjEvMDkvMjUvMDhmOWFhZTQtOWRjYy00MmY3LWJhNmItYzUxM2E4OWIxOWI3LmpwZy8xMDAw.jpg",
        type: "r&b",
        lyric: `You just made my day and everything turns right
                I'm not movin' on
                Just wanna sit and lookin' your brown eyes (sit and lookin' your brown eyes)
                And babe it's you
                You tell me bout' that situation I should really turn back
                And it's fine to know that you think we just friend girl

                เพียงแต่ว่าไอฉันนั้นมัน ดันคิดไปไกล
                เพียงแต่ว่าไอฉันนั้นเอง ที่อาจเผลอไป
                เพียงแต่เขาคนนั้น ของเธอก็ดีเกินไป
                ผิดเองแหละที่ฉันเองแหละ ที่คิดมากไป

                หยิบปากกาอันหนึ่งขึ้นมา เขียนจดหมายไปหา
                แต่ว่าใจมันก็ยังไม่กล้า กลัวว่าเธอไม่ให้อภัย
                (ถ้าฉัน) คิดถึงเธอ (ถ้าฉัน) บอกรักเธอ
                และเธอมาเห็นมัน คงโกรธกันมากมาย

                เก็บปากกาอันนั้นไว้เลย ใส่กระเป๋าเอาไว้
                อย่าให้ใครมาได้ยิน เสียงคำในหัวใจ
                แค่ฉัน ได้รักเธอแค่นั้นก็พอ หนึ่งชีวิตก็ดีเท่าไร

                หยิบปากกาอันหนึ่งขึ้นมา เขียนจดหมายไปหา
                แต่ว่าใจมันก็ยังไม่กล้า กลัวว่าเธอไม่ให้อภัย
                (ถ้าฉัน) คิดถึงเธอ (ถ้าฉัน) บอกรักเธอ
                และเธอมาเห็นมัน คงโกรธกันมากมาย

                เก็บปากกาอันนั้นไว้เลย ใส่กระเป๋าเอาไว้
                อย่าให้ใครมาได้ยิน เสียงคำในหัวใจ
                แค่ฉัน ได้รักเธอแค่นั้นก็พอ หนึ่งชีวิตก็ดีเท่าไร`,
        audio: '/upload/จดหมาย.mp3',
        fav: 22241
    },
    {
        nameSong: "เมะ (kiss by kiss)",
        imgSong: "https://s.isanook.com/jo/0/rp/r/w300/ya0xa0m1w0/aHR0cDovL2ltYWdlLmpvb3guY29tL0pPT1hjb3Zlci8wLzFlYzU0MWU5MTI2YTg2NWMvMTAwMC5qcGc=.jpg",
        type: "rap",
        lyric: `ถ้าเธอเลิกกับเขาแล้ว กลับมาหานะ
                อุตส่าห์เป็นคนดีและไม่มีพิษภัย
                ถ้าเธอเลิกกับเขาแล้ว อยู่กับฉันนะ
                จะไม่มีวันทำให้เธอต้องเสียใจ
                Just take it easy ในวันธรรมดา
                อยู่ด้วยกันอย่างนี้ แค่ในบางครั้งครา
                ไม่ต้องกังวลจะใช้เวลาให้หมดวัน
                Baby, I just need you in the way ที่รู้กัน

                And if you want me too, just text me back
                I missing you ทุกวันนั่นแหละ
                แต่คงไม่มีเวลามาสนใจ
                แม้ไม่มีทางที่พระอาทิตย์จะส่องมา
                ฉันได้แต่คอยถึงเธอที่อยู่แสนไกล

                แวะมานั่ง chill and imma get you fresh
                ไม่ปิด TV ให้เธอดูอนิเมะ
                ไม่ต้องมองเห็นฉัน อยู่ในเพียงสายตา
                ที่เธอมองเข้ามา ถ้าเธอไม่รู้สึก
                ในจินตนาการมีเพียงแค่เธอและฉัน
                อยู่ในปาฏิหาริย์และไม่รู้ตัว

                ถ้าเธอเลิกกับเขาแล้ว กลับมาหานะ
                อุตส่าห์เป็นคนดีและไม่มีพิษภัย
                ถ้าเธอเลิกกับเขาแล้ว อยู่กับฉันนะ
                จะไม่มีวันทำให้เธอต้องเสียใจ
                Just take it easy ในวันธรรมดา
                อยู่ด้วยกันอย่างนี้ แค่ในบางครั้งครา
                ไม่ต้องกังวลจะใช้เวลาให้หมดวัน
                Baby, I just need you in the way ที่รู้กัน

                ไม่มีสิทธิ์คิดไปคิดพิชิตพยายาม
                ไม่ kiss by kiss จุมพิตทรมาน
                ถ้าเธอบังเอิญเจอ อย่าทำเป็นเมินเลย
                ให้เป็นแบบเคย ๆ บอกฝันดีแบบเชย ๆ

                ถ้าเธอเลิกกับเขาแล้ว กลับมาหานะ
                อุตส่าห์เป็นคนดีและไม่มีพิษภัย
                ถ้าเธอเลิกกับเขาแล้ว อยู่กับฉันนะ
                จะไม่มีวันทำให้เธอต้องเสียใจ
                Just take it easy ในวันธรรมดา
                อยู่ด้วยกันอย่างนี้ แค่ในบางครั้งครา
                ไม่ต้องกังวลจะใช้เวลาให้หมดวัน
                Baby, I just need you in the way ที่รู้กัน`,
        audio: '/upload/เมะ (kiss by kiss).mp3',
        fav: 20031
    },
    {
        nameSong: "4:00",
        imgSong: "https://s.isanook.com/jo/0/rp/r/w700/ya0xa0m1w0/aHR0cDovL2ltYWdlLmpvb3guY29tL0pPT1hjb3Zlci8wLzRjZWUwMGMwNmI5NzhhNDgvNjQwLmpwZw==.jpg",
        type: "rap",
        lyric: `ตื่นขึ้นมาจากฝันดี ๆ ในตอนตีสี่
                ทั้งที่ไม่ได้คิด เรื่องอะไร
                บอกกับตัวเองเวลานี้ พยายามจะหลับตา
                แต่ก็ทำไม่ได้สักทีไม่รู้ทำไม
                ยังทำได้เพียงแค่สงสัย เป็นอะไร
                ที่ฉันเองพยายามนอนหลับตา

                ฝันฉันฝันถึงเธอ
                หลับตาลงทุกทียังเจอ
                เธอในนี้ไม่ว่าคราใด
                อยากจะนอนหลับตาอย่างนี้เรื่อยไป

                ยังฝันฉันฝันถึงเธอ
                หลับตาลงทุกทียังเจอ
                เธอในนี้ไม่ว่าคราใด
                อยากจะนอนหลับตาอย่างนี้เรื่อยไป

                ค่ำคืนที่แสนเหน็บหนาวที่เธอกอดเขาไว้
                เป็นราตรีเดียวกับฉันที่ยังฝันว่าเธอ
                กอดฉันทุกคืน ตรงนี้
                แค่ได้เห็นเธอกับเขามันก็เจ็บแค่ไหน
                ยังต้องทนทรมาน ยังต้องฝันถึงเธอ
                ที่เธอยังกอดฉันในตรงนี้
                
                นอนหลับตาฝันฉันฝันถึงเธอ
                หลับตาลงทุกทียังเจอ
                เธอในนี้ไม่ว่าคราใด
                อยากจะนอนหลับตาอย่างนี้เรื่อยไป

                ยังฝันฉันฝันถึงเธอ
                หลับตาลงทุกทียังเจอ
                เธอในนี้ไม่ว่าคราใด
                อยากจะนอนหลับตาอย่างนี้เรื่อยไป

                ฝันฉันฝันถึงเธอ
                หลับตาลงทุกทียังเจอ
                เธอในนี้ไม่ว่าคราใด
                อยากจะนอนหลับตาอย่างนี้เรื่อยไป

                ยังฝันฉันฝันถึงเธอ
                หลับตาลงทุกทียังเจอ
                เธอในนี้ไม่ว่าคราใด
                อยากจะนอนหลับตาอย่างนี้เรื่อยไป

                ฝันฉันฝัน ฉันฝันถึงเธอ
                กอดเธอฉันนอนละเมอ
                ฝันฉันฝัน ฉันฝันถึงเธอ
                กอดเธอฉันนอนละเมอ

                ฝันฉันฝัน ฉันฝันถึงเธอ
                กอดเธอฉันนอนละเมอ
                ฝันฉันฝัน ฉันฝันถึงเธอ
                กอดเธอฉันนอนละเมอ

                ฝันฉันฝัน ฉันฝันถึงเธอ
                กอดเธอฉันนอนละเมอ
                ฝันฉันฝัน ฉันฝันถึงเธอ
                กอดเธอฉันนอนละเมอ

                ฝันฉันฝัน ฉันฝันถึงเธอ
                กอดเธอฉันนอนละเมอ
                ฝันฉันฝัน ฉันฝันถึงเธอ`,
        audio: '/upload/4.00.mp3',
        fav: 24632
    },
    {
        nameSong: "พูดไม่ออก (JUST WONDER)",
        imgSong: "https://i.ytimg.com/vi/ieIRzixLvsE/maxresdefault.jpg",
        type: "pop",
        lyric: `ฉันคงจะตกหลุมรัก เธออีก
        I just wonder บางที
        แต่ว่าเธอน่ะใจร้าย แบบนี้
        ฉันก็พูดไม่ออก
        แต่รู้ว่าไม่ค่อยดีหรอก
        
        ตกหลุมรัก เธออีก
        I just wonder บางที
        แต่ว่าเธอน่ะใจร้าย แบบนี้
        ฉันก็พูดไม่ออก
        แต่รู้ว่าไม่ค่อยดีหรอก
        
        ฉันไม่คิดในชีวิตจะมาหลงรัก
        ไม่มีสิทธิ์คิดอะไรแบบนั้นหรอก
        รู้ฉันรู้มันยากจะบอก
        เธอฉันไม่ควรเอาแต่ใจ
        ถ้าเธอคิดจะไป
        
        แค่เธอยิ้ม มองลงมา
        ฉันก็เพ้อไปทุกทีทุกเวลา
        เธอไม่เหมือนใคร
        แต่ฉันคนธรรมดา
        แต่ถ้าจะเก็บเธอไว้
        ใครก็คงจะเวทนา
        
        ฉันคงจะตกหลุมรัก เธออีก
        I just wonder บางที
        แต่ว่าเธอน่ะใจร้าย แบบนี้
        ฉันก็พูดไม่ออก
        แต่รู้ว่าไม่ค่อยดีหรอก
        
        ตกหลุมรัก เธออีก
        I just wonder บางที
        แต่ว่าเธอน่ะใจร้าย แบบนี้
        ฉันก็พูดไม่ออก
        แต่รู้ว่าไม่ค่อยดีหรอก
        
        แอบดูตอนที่เขา
        ส่งข้อความ มาบอกเธอ
        อย่าทำอย่างนี้ ทำอย่างนั้น
        ฉันก็ได้แต่ แอบดูตอนที่เขา
        ส่งข้อความ มาบอกเธอ
        อย่าทำอย่างนี้ ทำอย่างนั้น
        ฉันก็ได้แต่มอง
        
        ฉันคงจะตกหลุมรัก เธออีก
        I just wonder บางที
        แต่ว่าเธอน่ะใจร้าย แบบนี้
        ฉันก็พูดไม่ออก
        แต่รู้ว่าไม่ค่อยดีหรอก
        
        ตกหลุมรัก เธออีก
        I just wonder บางที
        แต่ว่าเธอน่ะใจร้าย แบบนี้
        ฉันก็พูดไม่ออก
        แต่รู้ว่าไม่ค่อยดีหรอก`,
        audio: '/upload/พูดไม่ออก (JUST WONDER).mp3',
        fav: 23645
    },
    {
        nameSong: "ลาลาลอย (100%)",
        imgSong: "https://i.ytimg.com/vi/jdiRSOkzQns/maxresdefault.jpg",
        type: "rap",
        lyric: `ฉันจะพาเธอลอย ล่องไปในอวกาศ
        ที่มีแต่เธอ มีแต่เธอ เธอไม่ต้องกลัว
        ฉันจะพาเธอลอย ล่องไปในอันตราย
        จะมีแต่เธอ มีแต่เธอแต่ไม่ต้องกลัว
        
        คิดถึงฉันวันละนิด คิดตอนเธอยังมีสิทธิ์
        ชิดวันละนิดก็พอ
        I said shit 100% rich ไม่ต้องคิดชีวิต
        Lit เธอไม่ต้องนั่งรอ
        I said ต้องพยายามทักไลน์
        พรรณนามากมาย But you said bye bye
        I said don't be a little kid
        Just do it like a quiz
        I'm gonna let u fly
        
        ความรักจะไม่ตกหลุม
        ความรักทำให้หลงรัก
        เหนื่อยไหมอยากให้เธอพัก
        ก่อนที่ฉันจะพาเธอลอย
        
        ความรักจะไม่ตกหลุม
        ความรักทำให้หลงรัก
        เหนื่อยไหมอยากให้เธอพัก
        ก่อนที่ฉันจะพาเธอลอย
        
        ฉันจะพาเธอลอยล่องไปในอวกาศ
        ที่มีแต่เธอมีแต่เธอ เธอไม่ต้องกลัว
        ฉันจะพาเธอลอย ล่องไปในอันตราย
        จะมีแต่เธอมีแต่เธอ แต่ไม่ต้องกลัว
        
        ตอนจบก็ไม่มีใครเขาบอกเธอ
        แค่ในละครยังหลอกเลย
        แค่ไม่ได้คิดว่าก่อนเคยเป็นมายังไง
        และพระเอกก็ไม่ได้พิเศษเสมอไป
        หรือแสนดีเลิศเลออย่างเข้าใจ
        แบบที่คิดไว้ใดๆ
        I don't wanna take your time
        สะดุดอีกแล้วหลงรักเธอจนละลาย
        Oh baby girl I just wanna get you fly
        
        ฉันจะพาเธอลอย ล่องไปในอวกาศ
        ที่มีแต่เธอมีแต่เธอ เธอไม่ต้องกลัว
        ฉันจะพาเธอลอย ล่องไปในอันตราย
        จะมีแต่เธอมีแต่เธอ แต่ไม่ต้องกลัว`,
        audio: '/upload/ลาลาลอย.mp3',
        fav: 24956
    },
    {
        nameSong: "ที่ปรึกษา - [ Re-produced by TheTOYS ]",
        imgSong: "https://i.ytimg.com/vi/-IkfnFeojFY/maxresdefault.jpg",
        type: "rap",
        lyric: `ทะเลาะกับเขามาทีไรทีไร ก็จะเป็นหน้าที่ฉัน
        เช็ดน้ำตาให้เธอ บอกให้เธอทำใจเย็นๆ
        ต้องพูดว่าเขาไม่ได้ตั้งใจ อาจจะเป็นแค่เรื่องเล็ก
        และในวันพรุ่งนี้เธอและเขาก็คงเข้าใจกัน
        
        ทุกครั้งต้องพูดคำเดิมๆ คำเดิมๆ ว่าอย่าเอาแต่ใจนัก
        ให้ทำตัวดีๆ คงรักกันไปได้อีกนาน
        บอกเธอให้คืนดีกับเขา แต่ใจฉันมันจะละลาย
        ก็กลั้นน้ำตา แทบจะไม่ไหวรู้บ้างไหมเธอ
        
        บอกใจตัวเองว่าไม่อิจฉา (ฝืนใจบอกใจ)
        ว่าเราต้องไม่อิจฉา เพราะคนอย่างเรามันเป็นแค่ที่ปรึกษา
        คอยให้คำปรึกษา แล้วก็จบกัน
        อยากบอกกับเธอให้เลิกกับเขา (แล้วมองกลับมา)
        มามีหัวใจให้ฉัน รู้ดีแก่ใจว่ามันไม่ง่ายอย่างนั้น
        มันไม่ง่ายอย่างนั้น เป็นแค่ที่ปรึกษา ก็ยอม
        
        When I wipe your tears
        so don't your hand seems never let it go
        และต้องมีเวลาฟังเรื่องราวยาวๆ ของเธอ
        แต่ฉันไม่รู้ว่าถ้าวันหนึ่งในทุกๆ วัน
        ที่ไม่มีเธอในราตรี ที่ยังอันตรายฉันภาวนา
        ให้ทุกๆ วันเธอนั้นจงนอนและหลับฝันดี
        
        ทุกครั้งต้องพูดคำเดิมๆ คำเดิมๆ ว่าอย่าเอาแต่ใจนัก
        ให้ทำตัวดีๆ คงรักกันไปได้อีกนาน
        บอกเธอให้คืนดีกับเขา แต่ใจฉันมันจะละลาย
        ก็กลั้นน้ำตาแทบจะไม่ไหวรู้บ้างไหมเธอ
        
        บอกใจตัวเองว่าไม่อิจฉา (ฝืนใจบอกใจ)
        ว่าเราต้องไม่อิจฉา เพราะคนอย่างเรามันเป็นแค่ที่ปรึกษา
        คอยให้คำปรึกษา แล้วก็จบกัน
        อยากบอกกับเธอให้เลิกกับเขา (แล้วมองกลับมา)
        มามีหัวใจให้ฉัน รู้ดีแก่ใจว่ามันไม่ง่ายอย่างนั้น
        มันไม่ง่ายอย่างนั้น เป็นแค่ที่ปรึกษาก็ยอม
        
        บอกใจตัวเองว่าไม่อิจฉา (ฝืนใจบอกใจ)
        ว่าเราต้องไม่อิจฉา เพราะคนอย่างเรามันเป็นแค่ที่ปรึกษา
        คอยให้คำปรึกษา แล้วก็จบกัน
        อยากบอกกับเธอให้เลิกกับเขา (แล้วมองกลับมา)`,
        audio: '/upload/ที่ปรึกษา.mp3',
        fav: 18753
    },
    {
        nameSong: "ไม่รับสาย (Free Call)",
        imgSong: "https://www.dochord.com/wp-content/uploads/2019/08/Free-Call-The-Toys.jpg",
        type: "rap",
        lyric: `ไม่ต้องโทรมา เพราะฉันจะไม่รับสาย
        ฉันไม่กล้าคิดบ่อยๆ กลัวจะต้องคิดลอยๆ
        ไม่ต้องโทรมา เพราะฉันจะไม่รับสาย
        ฉันไม่กล้าคิดบ่อยๆ กลัวจะต้องคิดลอยๆ
        
        ยกรูปโทรศัพท์ของคุณที่หน้าจอ เพื่อนเขาหาว่าบ้าบอ
        คุณบอกผม 10 ปีผมก็กล้ารอ แต่แม่งไม่มากพอ
        และไม่ต้องกอดปลอบผมหรอกผมไม่ได้บ้ายอ
        นั่งรอคุณเดินผ่านอยู่ที่หน้ามอ
        กด A Floor ให้คุณอ่านข้อความหน้าจอ
        ฉันเฝ้าคอยคุณกลับบ้านไปอยู่ด้วยกัน
        ที่ชั้นลอย ฉันเลยเป็นคนไม่ดีจึงไม่เป็นไรหรอก
        
        คนที่แล้วๆ มาเธอบอกอย่างนี้รึเปล่า
        ไม่รู้ว่ารักคืออะไรก็เลยไม่กล้าจะบอกใคร
        เพราะมีแต่คุณทั้งหัวใจ
        ก็คนที่แล้วๆ มาก็บอกอย่างนี้ทุกที
        ก็นั้นไม่ใช้ผมไง คุณไม่ต้องไว้ใจ
        ไว้สักวันคุณรักใคร เดี๋ยวคุณเข้าใจล่ะ
        
        ไม่ต้องโทรมา เพราะฉันจะไม่รับสาย
        ฉันไม่กล้าคิดบ่อยๆ กลัวจะต้องคิดลอยๆ
        ไม่ต้องโทรมา เพราะฉันจะไม่รับสาย
        ฉันไม่กล้าคิดบ่อยๆ กลัวจะต้องคิดลอยๆ
        
        อย่าพาดพิงให้ผมน่ะผิดเลยได้แต่พร่ำเพ้อ
        พอแล้วกับเพื่อนที่พัวพันเพราะได้แต่พลาดพลั้ง
        อย่าคาดคั้นเพราะชาตินั้น พี่ไม่ได้เกิดมาดูแล
        แค่จะแก้ตัว ในชาตินี้จะขอมาดูแทน
        
        ก็ได้แต่ Hold สติอีกนิดประดุจพินิจไฟอิทธิฤทธิ์
        ฉัน Cold bro like a shit ฉัน On flow ไม่มีทิศ
        และไม่ว่าเมื่อไร ที่คุณพร้อมจะเดิน
        จับมือข้ามกันไป จะขอแค่คุณเชิญ
        
        ไม่ต้องโทรมา เพราะฉันจะไม่รับสาย
        ฉันไม่กล้าคิดบ่อยๆ กลัวจะต้องคิดลอยๆ
        ไม่ต้องโทรมา เพราะฉันจะไม่รับสาย
        ฉันไม่กล้าคิดบ่อยๆ กลัวจะต้องคิดลอยๆ
        
        (นิดเดียวน่ะ นิดเดียว)
        (นิดเดียวน่ะ นิดเดียว)
        ฉัน Like a เทพพญาทาน
        กว่าเทพพญาดา
        Like a จินตนาการ
        (นิดเดียวน่ะ นิดเดียว)
        (นิดเดียวน่ะ นิดเดียว)`,
        audio: '/upload/ไม่รับสาย (Free Call).mp3',
        fav: 17532
    },
    {
        nameSong: "ไวน์ลดา (blurblur)",
        imgSong: "https://i.ytimg.com/vi/9ViDdHDtQnA/maxresdefault.jpg?v=60e37d7b",
        type: "rap",
        lyric: `จะทำยังไงก็ไม่รัก ยังไงก็ไม่แคร์
        ไม่เห็นว่าจะมีความหมาย
        เธอคงจะไม่รัก ฉันควรจะต้องปล่อย
        ไม่เห็นต้องลำบากยากเลย
        
        จะทำยังไงก็ไม่รัก ยังไงก็ไม่แคร์
        แล้วฉันนั้นต้องทำแบบไหน
        เธอคงจะไม่รัก ฉันควรจะต้องปล่อย
        ไม่เห็นต้องลำบากยากเลย
        
        Cuz when เธอแค่มองตาและมองมาบ่อยๆ
        Lips เธอที่ทาพาฉันคิดไปลอยๆ
        บางเวลาที่ฉันแอบคิดและปรารถนาแอบจินตนาการ
        คงเป็นเวลาที่เธอแอบ Kissing อยู่กับเขาแค่พรรณาไป
        
        แต่แล้วต้องทำยังไงที่ใจเป็นดังเดิม
        ใช้เวลาที่มีอยู่ในความคิดเฉิ่มๆ
        Everyday I've อลเวง but chill away ain't nothing go to say
        But really really miss that day
        
        จิบไวน์บางเวลา Even ใน Wednesday
        Smokin เป็นเวลาไม่ใช่คนเสเพล
        Still hope in the god I gotta say
        เธอไม่บอก Wish u all the best ขอให้เธอมีความสุขก็โอเค
        
        จะทำยังไงก็ไม่รัก ยังไงก็ไม่แคร์
        ไม่เห็นว่าจะมีความหมาย
        เธอคงจะไม่รัก ฉันควรจะต้องปล่อย
        ไม่เห็นต้องลำบากยากเลย
        
        จะทำยังไงก็ไม่รัก ยังไงก็ไม่แคร์
        แล้วฉันนั้นต้องทำแบบไหน
        เธอคงจะไม่รัก ฉันควรจะต้องปล่อย
        ไม่เห็นต้องลำบากยากเลย
        
        รักดีดีที่เธอมีให้กัน
        วันดีดีที่เธอมีให้เขา
        
        จะทำยังไงก็ไม่รัก ยังไงก็ไม่แคร์
        ไม่เห็นว่าจะมีความหมาย
        เธอคงจะไม่รัก ฉันควรจะต้องปล่อย
        ไม่เห็นต้องลำบากยากเลย
        
        จะทำยังไงก็ไม่รัก ยังไงก็ไม่แคร์
        แล้วฉันนั้นต้องทำแบบไหน
        เธอคงจะไม่รัก ฉันควรจะต้องปล่อย
        ไม่เห็นต้องลำบากยากเลย`,
        audio: '/upload/ไวน์ลดา (blurblur).mp3',
        fav: 23565
    }
];

const songHero = [
    {
        nameSong: "เสือสิ้นลาย",
        imgSong: "https://i.ytimg.com/vi/47hae1Xw_Xw/maxresdefault.jpg",
        type: "rap",
        lyric: `Hey Hey OYO FHERO
                OK YO OK DeejayB Yeah

                เมื่อก่อนผมเคยร้าย ร้าย ร้าย
                Bad boy ก็ดูคล้าย คล้าย คล้าย
                ก็ You ลอง Look into My Eyes
                สาบานให้ตาย ตาย ตาย

                เล่นแต่บทผู้ร้าย ร้าย ร้าย
                แต่ตอนนี้เป็นเสือสิ้นลาย
                You Look into My Eyes
                สาบานให้ตาย ตาย ตาย
                ฉันผ่านมาหมดแล้ว
                ฉันนี่โคตรจะสุดแล้ว (Ay)
                แต่ตอนนี้อยากจะหยุดแล้ว (Ay)
                มีเยอะมันวุ่นวาย (Aha)

                เมื่อก่อนเจ้าชู้ อันนี้ยอม
                แต่เลิกหมดแล้ว ตอนนี้พร้อม
                แค่เธอได้ไหมฉันขอร้อง
                ให้เธอเป็นคนพาเข้านอน

                เมื่อก่อนนี้ญาติเขายังระอาพี่เลย
                นาฬิกาบอกสิบโมงเช้า
                ยังอยู่ใน Party เลย

                แต่เจอเธอแล้วปัจจุบัน
                ไม่เอาแล้วหนาที่เคย
                จากเป็นเสือแล้วอยู่ดีดี
                พี่กลายเป็น Barbie เลย
                Ooh Ooh Ooh

                เคยเป็นผู้ชายที่เกเร (Woo)
                กินเหล้าและเมาเละหยำเป (Ay)
                เดินไปเจอใครเขาก็บอกว่าพี่รั่ว
                การทรงตัวพี่เหนือการคาดคะเน (Ay)

                แต่พอเจอเธอแล้ว Babae
                พอแล้วไม่อยากจะเดินเซ
                อยากเป็นคนดีเพื่อเดินข้างใครสักคน
                อยากจะกลายมาเป็นคนที่ OK (Hoo hoo hoo)

                เคยเป็นผู้ร้าย ร้าย ร้าย
                นักเลงหัวไม้ ไม้ ไม้
                แต่มาวันนี้สวัสดีพ่อตา
                สวัสดีครับแม่ยาย

                อย่าเพิ่งร้องว้าย ว้าย ว้าย
                ผมกลับตัวแล้วรู้ไหม
                จะขอดูแลลูกสาวแม่
                จนวันตาย ตาย ตาย

                อยากจะหยุดที่เธอ
                บอกตัวเองให้พอ
                ไม่งั้นเธอคงไม่รอ
                คงไม่รอ คงไม่รอ

                ฉันอาจเป็นคนไม่ดี
                หรืออาจจะดีไม่พอ
                แต่ให้เธอไปหมดแล้ว
                เท่าที่มี เท่าที่มี

                เมื่อก่อนผมเคยร้าย ร้าย ร้าย
                Bad boy ก็ดูคล้าย คล้าย คล้าย
                ก็ You ลอง Look into My Eyes
                สาบานให้ตาย ตาย ตาย

                เล่นแต่บทผู้ร้าย ร้าย ร้าย
                แต่ตอนนี้เป็นเสือสิ้นลาย
                You Look into My Eyes
                สาบานให้ตาย ตาย ตาย

                ฉันผ่านมาหมดแล้ว
                ฉันนี่โคตรจะสุดแล้ว (Ay)
                แต่ตอนนี้อยากจะหยุดแล้ว (Ay)
                มีเยอะมันวุ่นวาย (Aha)

                เมื่อก่อนเจ้าชู้ อันนี้ยอม
                แต่เลิกหมดแล้ว ตอนนี้พร้อม
                แค่เธอได้ไหมฉันขอร้อง
                ให้เธอเป็นคนพาเข้านอน

                เพื่อนบอกว่า ใครกลัวเมีย (Huh)
                นายออกจากแก๊งเราไป
                ไม่สนคนรอบข้างจะว่ายังไง
                But I don't care
                งั้นเดี๋ยวเราจะไปตั้งแก๊งใหม่
                
                เลิกสะสมฝาเบียร์
                แล้วกลับบ้านไปกอดเมีย (Woo)
                สาวสาวเลิกนัวเนีย
                เลิกเจ้าชู้เธอไม่รู้ผมไม่ทำ
                ต่อให้มีน้องหนูยิ้มให้เป็นประจำ (Haha)

                และนั่นคือภาพที่มีในอดีต
                ช่างมันดิช่างมันดิช่างมันดิ
                ตอนนี้หมดห่วงไม่ต้องระแวง
                Karma Dose Exist Yeh

                เมื่อก่อนแอบแชทก็พูดตรงตรง
                แต่ปัจจุบันนี้เป็นคนละคน
                เธอไม่ต้องลุ้นเหมือนสามตัวบน
                มอบรหัส Facebook ให้เธอไปเชยชม

                อยากจะหยุดที่เธอ
                บอกตัวเองให้พอ
                ไม่งั้นเธอคงไม่รอ
                คงไม่รอ คงไม่รอ

                ฉันอาจเป็นคนไม่ดี
                หรืออาจจะดีไม่พอ
                แต่ให้เธอไปหมดแล้ว
                เท่าที่มี เท่าที่มี (Yeah)

                เมื่อก่อนผมเคยร้าย ร้าย ร้าย
                Bad boy ก็ดูคล้าย คล้าย คล้าย
                ก็ You ลอง Look into My Eyes
                สาบานให้ตาย ตาย ตาย

                เล่นแต่บทผู้ร้าย ร้าย ร้าย
                แต่ตอนนี้เป็นเสือสิ้นลาย
                You Look into My Eyes
                สาบานให้ตาย ตาย ตาย

                ถ้าเธอทำได้จริง
                Please Bring Me Your Ring
                I Promise to Be Your Wings Babe (โน่ว)

                ถ้าเธอผิดสัญญา
                ทำไม่ได้ที่พูดมา
                ฉันจะเอาให้ตาย ตาย ตาย
                Yah Yah Yah (ฮูว)

                เงินเดือนพี่เธอเอาไปให้หมดเลย (ค่ะ)
                มีผ้าให้สักกี่ผืนเธอเอามาให้หมดเลย (เก่งมาก)
                อยากได้เสื้อผ้ารองเท้า
                เดี๋ยวพี่จะเปย์เงินสดเลย (ได้ค่ะ)
                อยากได้กุชช่งกุชชี่
                ให้เธอเอาบัตรไปกดเลย (น่ารัก)

                เมื่อก่อนผมเคยร้าย ร้าย ร้าย
                Bad boy ก็ดูคล้าย คล้าย คล้าย (Muah)
                ก็ You ลอง Look into My Eyes
                สาบานให้ตาย ตาย ตาย (ร้าย ร้าย ร้าย)

                เล่นแต่บทผู้ร้าย ร้าย ร้าย
                แต่ตอนนี้เป็นเสือสิ้นลาย
                You Look into My Eyes
                สาบานให้ตาย ตาย ตาย (Woo)`,
        audio: '/upload/เสือสิ้นลาย.mp3',
        fav: 23564
    },
    {
        nameSong: "จำเลยรัก (Defendent Of Love)",
        imgSong: "https://i.ytimg.com/vi/PSEcZas-QZg/maxresdefault.jpg",
        type: "rap",
        lyric: `จำเลยอย่าแย้ง
                หากยังไม่มีอะไรจะกล่าว
                ยอมมอบใจมาซะดีดี
                ความผิดของเธอนั้นมีดังนี้

                หนึ่งคือเธอน่ะเห็น
                ฉันเป็นคนอื่นไกล
                เชื่อเถอะว่าฉันพร้อม
                ไม่ว่าเป็นเรื่องใด
                โทษนะคะที่รัก
                เธอยังฟังอยู่ไหม
                ข้อต่อไปมันก็สำคัญ
                I'ma tell you ข้อที่สอง
                เรื่องที่เธอชอบใคร
                ศาลตัดสินเป็นครั้งสุดท้าย
                เรื่องที่เธอต้องชดใช้
                นับจากนี้ตลอดชีวิต
                ต้องอยู่กับฉัน
                ตลอดไป

                คดีนี้ช่างอุกฉกรรจ์
                สะเทือนขวัญประชาชี
                เหตุจากคืนนั้นเธอมาชนแก้ว
                แล้วเธอก็หายในราตรี
                เธอโปรยเสน่ห์
                แล้วทิ้งฉันไปไม่ปรานี
                สรุปเธอไปกับใคร
                อย่าให้การเลี่ยงบาลี
                น้ำตาไหลเป็นวารี
                แล้วตัวเธอก็ไลน์ทัก
                พอฉันเริ่มอินเธอกลับบอก
                ว่าอย่าไปคิดมากมายนัก
                พอฉันจะคลายรัก
                กลับส่งคำหวานมาทายทัก
                มาบอกว่าเหงามาบอกว่าเพ้อ
                บอกว่าอยากเจอจะตายชัก
                แม่จำเลยรัก
                หัวใจคนไม่ใช่ผนังนะ
                ไอ้คำว่ารัก
                ก็ไม่ใช่ทองต้องซ่อนตรงหลังพระ
                ไปไปมามา
                ให้ความหวังนี่มันอิหยังวะ
                คดีร้ายแรงศาลต้องตัดสิน
                จำเลยเป็นผู้ต้องขังละ
                
                จำเลยอย่าแย้ง
                หากยังไม่มีอะไรจะกล่าว
                ยอมมอบใจมาซะดีดี
                ความผิดของเธอนั้นมีดังนี้

                หนึ่งคือเธอน่ะเห็น
                ฉันเป็นคนอื่นไกล
                เชื่อเถอะว่าฉันพร้อม
                ไม่ว่าเป็นเรื่องใด
                โทษนะคะที่รัก
                เธอยังฟังอยู่ไหม
                ข้อต่อไปมันก็สำคัญ
                I'ma tell you ข้อที่สอง
                เรื่องที่เธอชอบใคร
                ศาลตัดสินเป็นครั้งสุดท้าย
                เรื่องที่เธอต้องชดใช้
                นับจากนี้ตลอดชีวิต
                ต้องอยู่กับฉัน
                ตลอดไป

                ยอมมอบใจเพราะความคิดถึง
                ล้อมเธอไว้หมดแล้ว
                ทะเบียนสมรสกับนายอำเภอ
                ก็รอเธอจดแล้ว
                แหวนเพชรสินสอด
                รอให้เธอกอด
                รวมถึงเงินสดแล้ว
                Gucci Belt งูมันเลื้อย
                รอเธอหลายขดแล้ว
                ตามกฎแล้ว
                ว่าทำนองครองธรรม
                จำเลยรักจะอยู่เรือนหอ
                แทนการอยู่เรือนจำ
                โซ่ตรวนจะกลายเป็นสร้อยคอทองคำ
                และจะมีศาลผู้พิพากษา
                อยู่ร่วมเรือนหอจองจำ
                ไม่ต้องมีคำอนุญาโตตุลาการ
                ไม่ต้องมายื่นอุทธรณ์
                แล้วปล่อยให้ฟ้าเป็นพยาน
                ว่าพันธนาการสองเรา
                แม้นไกลจะหาใกล้
                แม้นจำเลยรักต้องการสิ่งใด
                ให้บอกมาเลยจะหาให้
                จนกว่าจะหาไม่

                จำเลยอย่าแย้ง
                หากยังไม่มีอะไรจะกล่าว
                ยอมมอบใจมาซะดีดี
                ความผิดของเธอนั้นมีดังนี้

                หนึ่งคือเธอน่ะเห็น
                ฉันเป็นคนอื่นไกล
                เชื่อเถอะว่าฉันพร้อม
                ไม่ว่าเป็นเรื่องใด
                โทษนะคะที่รัก
                เธอยังฟังอยู่ไหม
                ข้อต่อไปมันก็สำคัญ
                I'ma tell you ข้อที่สอง
                เรื่องที่เธอชอบใคร
                ศาลตัดสินเป็นครั้งสุดท้าย
                เรื่องที่เธอต้องชดใช้
                นับจากนี้ตลอดชีวิต
                ต้องอยู่กับฉัน
                ตลอดไป

                แม้มันอาจจะดูใจร้าย
                แต่ให้คำสาบานเลย
                ต่อให้ตัวต้องตาย
                ว่าเจตนา
                ไม่เคยต้องการจะทำร้ายเลย
                ธรณีนี่นี้เป็นพยาน
                จะไม่เจ้าชู้ประตูดิน
                ให้เหมือนกับคำพังเพยทัก
                เพราะว่าใจมันหวงเกินไป
                เกินจะให้ใครชมเชยนัก
                จะรักให้มากที่สุด
                ให้เหมือนกับใจไม่เคยรัก
                สุดท้ายศาลรู้ตัวดี
                ว่าศาลนี่แหละจำเลยรัก

                หนึ่งคือเธอน่ะเห็น
                ฉันเป็นคนอื่นไกล
                เชื่อเถอะว่าฉันพร้อม
                ไม่ว่าเป็นเรื่องใด
                โทษนะคะที่รัก
                เธอยังฟังอยู่ไหม
                ข้อต่อไปมันก็สำคัญ
                I'ma tell you ข้อที่สอง
                เรื่องที่เธอชอบใคร
                ศาลตัดสินเป็นครั้งสุดท้าย
                เรื่องที่เธอต้องชดใช้
                นับจากนี้ตลอดชีวิต
                ต้องอยู่กับฉัน
                ตลอดไป

                จำเลยอย่าแย้ง
                หากยังไม่มีอะไรจะกล่าว
                ยอมมอบใจมาซะดีดี
                ต้องเป็นจำเลยของฉันคนนี้ตลอดไป`,
        audio: '/upload/จำเลยรัก (Defendant Of Love).mp3',
        fav: 19663
    },
    {
        nameSong: "มีแค่เรา",
        imgSong: "https://i.ytimg.com/vi/7bkHtMw620M/maxresdefault.jpg",
        type: "rap",
        lyric: `ก็เพราะวันนี้นั้นมีแค่เรา
                ตอนนี้ต้องการแค่เมา
                ถ้าไม่มีเขาคงไม่เท่าไร
                ไม่ต้องไปร้องไม่ต้องเสียใจ
                ชูแก้วเด่ะ แล้วก็ชน
                ถ้ามันจะไปก็ไป
                ไม่ต้องมาทุกข์ต้องมาทน
                อย่าช้ารีบมาให้ไว
                ปล่อยความช้ำลอยไปให้ไกล
                จากนี้ไม่ว่าเมื่อไหร่
                Only Have Fun, All Everynight
                จุดไฟขึ้นมาแล้วก็ลน
                เอ้า เพื่อนมากี่คน
                เรียกมาให้ไว ก็จะวน จะวน

                เธอไปกับใครตั้งกี่คนก็ยังทนอยู่
                เมียอย่างซุกแม่งอย่างซน ว่าเอาอยู่
                แต่ไม่เอาแล้วบาย ไม่สนหรอกรอยจูบ
                จนคนประณามว่าอย่างควายให้เธอน่ะดูถูก
                เปลืองเข็มนาฬิกาอย่าเอาเวลาไปใส่ใจ
                ใครจะลืมทอดทิ้งให้ปล่อยไป
                ไม่ต้องฟังคำคนอย่าไปสนลมปากใคร
                ทนนานมันมีแต่ความลำบากใจ
                คนนั้นอย่างเฟี้ยวเดี๋ยวเคี้ยวโชว์ให้ดู
                อย่าเอามือล้วงไปในปากงู
                ที่ทำเป็นประจำหัดดู
                Slow Slow Sure Sure
                คือความจริงคือปาก(เองแหล่ะ)

                ก็เพราะวันนี้นั้นมีแค่เรา
                ตอนนี้ต้องการแค่เมา
                ถ้าไม่มีเขาคงไม่เท่าไร
                ไม่ต้องไปร้องไม่ต้องเสียใจ
                ชูแก้วเด่ะ แล้วก็ชน
                ถ้ามันจะไปก็ไป
                ไม่ต้องมาทุกข์ต้องมาทน
                อย่าช้ารีบมาให้ไว
                ปล่อยความช้ำลอยไปให้ไกล
                จากนี้ไม่ว่าเมื่อไหร่
                Only Have Fun, All Everynight
                จุดไฟขึ้นมาแล้วก็ลน
                เอ้า เพื่อนมากี่คน
                เรียกมาให้ไว ก็จะวน จะวน

                บอกกับทุกที
                ว่าคนนี้แหล่ะที่อยากมีลูกกับเค้า
                มั่นใจเหลือเกินว่าใช่
                แล้วก็ปล่อยใจบนเตียงบนฟูกกับเค้า
                แต่รักไม่ใช่แค่จูบ แค่โอบ
                แค่กอด แค่ไล้ แค่ลูบกับเร้า
                สุดท้ายพอโดนเค้าเจี๊ย
                ก็เนี่ยเตือนละ มันมีแค่เจ๊งกับเจ๊า
                ก็เอาเหอะ ปล่อยมันไป
                อยู่กันก็จะมีแต่พาจน
                เห็นกงจักรเป็นดอกบัว
                ทีดอกบัวกลับเห็นเป็นอาจม
                โบราณเค้าถึงบอกว่า
                แฟนเปรียบเหมือนรองเท้า
                และเพื่อนเหมือนส้น
                เพราะต่อให้รองเท้าหายไป
                ส้นก็ยังอยู่กับทุกซีน

                ก็เพราะวันนี้นั้นมีแค่เรา
                ตอนนี้ต้องการแค่เมา
                ถ้าไม่มีเขาคงไม่เท่าไร
                ไม่ต้องไปร้องไม่ต้องเสียใจ
                ชูแก้วเด่ะ แล้วก็ชน
                ถ้ามันจะไปก็ไป
                ไม่ต้องมาทุกข์ ต้องมาทน
                อย่าช้ารีบมาให้ไว
                ปล่อยความช้ำลอยไปให้ไกล
                จากนี้ไม่ว่าเมื่อไหร่
                Only Have Fun, All Everynight
                จุดไฟขึ้นมาแล้วก็ลน
                เอ้า เพื่อนมากี่คน
                เรียกมาให้ไว ก็จะวน จะวน

                โอ เยเยเยเย
                เยกันมากี่ครั้งแล้วเค้าก็เท
                โอเค โอเค โอเค โอเค
                พูดอย่างนั้นแล้วก็เซ
                รู้เศร้าเข้ามาดื่มมาๆ
                เห็นว่าเขาทิ้งไปแบบคาตา
                โดนทำร้ายจิตใจด้วยวาจา
                ถ้าจะจบกันไปก็อย่าให้มันกลับมาอีกนะ
                ไม่อยากฟังเรื่องมันอีกละ
                คนดีๆน่ะมีอยู่ซะ
                รักคนเลวๆอยู่ได้คิดอะไรอยู่วะ
                ดื่มด้วยกันเลยวันสุดท้าย
                เอาให้ลืมเลยคนใจร้าย
                เมากระจาย ไอ้ฉิ*หาย
                แก้วอยู่ไหนจะเอาให้ตาย

                ก็เพราะวันนี้นั้นมีแค่เรา
                ตอนนี้ต้องการแค่เมา
                ถ้าไม่มีเขาคงไม่เท่าไร
                ไม่ต้องไปร้องไม่ต้องเสียใจ
                ชูแก้วเด่ะ แล้วก็ชน
                ถ้ามันจะไปก็ไป
                ไม่ต้องมาทุกข์ ต้องมาทน
                อย่าช้ารีบมาให้ไว
                ปล่อยความช้ำลอยไปให้ไกล
                จากนี้ไม่ว่าเมื่อไหร่
                Only Have Fun, All Everynight
                จุดไฟขึ้นมาแล้วก็ลน
                เอ้า เพื่อนมากี่คน
                เรียกมาให้ไว ก็จะวน จะวน`,
        audio: '/upload/มีแค่เรา.mp3',
        fav: 23154
    },
    {
        nameSong: "FHERO",
        imgSong: "https://s.isanook.com/jo/0/rp/r/w728/ya0xa0m1w0/aHR0cHM6Ly9zLmlzYW5vb2suY29tL2pvLzAvdWQvNDgyLzI0MTI1OTcvcHIxZi5qcGc=.jpg",
        type: "rap",
        lyric: `อย่าจำฉันเลย ถ้าเธอเห็นฉันเป็นคนอื่น
        อย่าจำฉันให้เป็นใคร ที่ตัวฉันไม่ได้เป็น
        โปรดอย่าทำร้าย กันด้วยความรัก
        ที่ลวงตาไปด้วยความฝัน
        ฉันไม่ใช่คนอย่างนั้น เธอจะจำกันอย่างนั้น
        โปรดฟังฉัน อย่าจำฉันเลยจะดีกว่า
        
        F to da H to da E to da R O
        นี่คือนามกร Who live life as the Pablo
        สว่างเหมือน Picasso และมืดดำเหมือน Escobar
        ไรม์ระดับ P R O F E S S O R
        กูคือโนอาห์ผู้สร้างเรือ Ark ให้ Hip-Hoppers
        กูคือโยดาผู้สอนเพลงดาบ Luke Skywalker
        เปรียบประดุจจันทร์ Like a โอชา
        เปรียบ Star Like a Rocker
        มองกูสิโลกามองกูตั้งแต่หัวยัน Boxer
        กูนี่แหละคือ Rapper Rapper
        กู Rap มาตั้งแต่เกิดจนถึงเวลาตาย
        ตำนาน ตำนาน จดจำกูตั้งแต่เด็กจนถึงรุ่นตายาย
        สองมือ สองตีน หาได้มีสี่กรเหมือนองค์พระนารายณ์
        ตีนมึงราน้ำแต่มือกูรู้ว่าถึงเวลาพาย
        นี่คือซีนกูเล่นเป็นนักแสดงหลักมึงหลบไปมึงอย่าบัง
        ถ้ามีไมโครโฟนไว้แค่กระจายเสียงจงวางลงมึงอย่ากำ
        กูใช้ไมโครโฟนเปลี่ยนโลกด้วยเพลงถ้าไม่พอใจมึงอย่าฟัง
        สุดท้าย ถ้าหากมึงจะจำกูเป็นแค่แขกไปฟีทเจอริ่งมึงอย่าจำ
        
        อย่าจำฉันเลย ถ้าเธอเห็นฉันเป็นคนอื่น
        อย่าจำฉันให้เป็นใคร ที่ตัวฉันไม่ได้เป็น
        โปรดอย่าทำร้าย กันด้วยความรัก
        ที่ลวงตาไปด้วยความฝัน
        ฉันไม่ใช่คนอย่างนั้น เธอจะจำกันอย่างนั้น
        โปรดฟังฉัน อย่าจำฉันเลยจะดีกว่า
        
        ส่งเดโมให้เฮีย จาก The Boy Uptown
        ดินที่เฮียโจ้ปั้น ต้องมีสักวันมันจะกลายเป็นดาว
        ถ้าวันนั้นไร้เฮีย ไม่มีกู Right Now
        ใช่ชีวิตมันสั้น และความจริงคือศิลปะยืนยาว
        และนี่มันถึงคราวนับถอยหลังก่อนจะสิ้นลมหายใจ
        วางถุงกาวมึงลงซะถ้าจะบอกกูคล้ายใคร
        กูจะฝาก Skill ให้โลกต้องจารึกว่ากูร้ายไป
        ขอมอดไหม้เพื่อเปล่งประกายบนฟ้าเยี่ยงดอกไม้ไฟ
        ซ้ายไป ชิดใน สิบล้อมาแล้วสองแถวมึงหลบหน่อย
        ฤทธิ์ไกร พิษภัย เดชปาฏิหาริย์ถึงคราวกูปลดปล่อย
        สหาย มิตรใด ที่เชื่อในกูยกมือมาปรบหน่อย
        ส่วนศัตรูเข้ามามึงจะหมัดจะมวยจะควยหรือตบต่อย
        ควย มึงเกลียดสิ่งที่กูเป็นยังดีกว่า ให้มึงรักกูที่กูปลอม
        แม้นต้องดับสลายไปยังดีกว่า มีชีวิตแบบต้องจำยอม
        ก้ม หัว ให้ ใครมาดลบันดาล ขอสังเวยทั้งใจวิญญาณ
        Still FUCKING HERO จะเป็นตำนาน
        
        ขอร้องเธอโปรดมองฉันและสิ่งที่ฉันเป็นอยู่
        แล้วเธอจะรู้ ฉันมันเป็นใคร
        ถ้ารักกันอย่าทำร้ายกันด้วยการบอกว่าฉันเป็นใคร
        อย่าตัดสินคนอย่างฉัน อย่ามาชี้ทางให้ฉัน
        ไปอย่างนั้น อย่าจำฉันเลยจะดีกว่า
        
        ฟ้า หัวเราะ เยาะเย้ย เหวยเหวยฟ้า
        พสุธา อย่าครวญว่า ข้า ข่มเหง
        เย้ย ทั้งฟ้า ท้าทั้งดิน สิ้น ยำเกรง
        หรือใคร เก่ง เกิน ข้า ฟ้า ดินกลัว
        
        ฟ้า หัวเราะ เยาะเย้ย เหวยเหวยฟ้า
        พสุธา อย่าครวญว่า ข้า ข่มเหง
        เย้ย ทั้งฟ้า ท้าทั้งดิน สิ้น ยำเกรง
        หรือใคร เก่ง เกิน ข้า ฟ้า ดินกลัว
        
        อย่าจำฉันเลย ถ้าเธอเห็นฉันเป็นคนอื่น
        อย่าจำฉันให้เป็นใครที่ตัวฉันไม่ได้เป็น
        โปรดอย่าทำร้ายกันด้วยความรัก
        ที่ลวงตาไปด้วยภาพฝัน
        อย่ามาคิดแทนอย่างนั้น นี่มันชีวิตของฉัน
        ไม่อย่างนั้น อย่าจำฉันเลยจะดีกว่า`,
        audio: '/upload/FHERO.mp3',
        fav: 18964
    },
    {
        nameSong: "คาด-ตะ-กอน (Expecutioner)",
        imgSong: "https://i.ytimg.com/vi/HvaZE5RwxWw/maxresdefault.jpg",
        type: "rap",
        lyric: `มีฆาตกรกำลังตามล่าตัวมึงอยู่
        ระวังตัวให้ดี
         
        ความคาดหวังนั้นคือยาพิษ
        มันกำลังไล่ฆาตกรรมเราอย่างซาดิสม์
        มึงไม่อาจจะหนีด้วยแจ๊สหรือว่ายาริส
        เพราะว่ามันจะตามล่ามึงเหมือนแสงอาทิตย์
         
        แต่ว่ามัน เป็นยาพิษที่เราสมัครใจกลืน
        หลักประหารที่เราสมัครใจยืน
        คิดว่ามันอบอุ่นเหมือนกับผิงไฟฟืน
        สุดท้ายแล้วความคาดหวัง
        กำลังเหนี่ยวไกปืน
         
        มึงโทษว่าเพราะความรักน่ะทำให้มึงเจ็บ
        ก็เหมือนมึงโทษหลังคาตอนที่มันรั่วเพราะลูกเห็บ
        ตามสเต็ปคือเมื่อสะเออะไปรัก
        มันก็เหมือนแบกความ
        คาดหวังไว้เต็มกระบะไปละ
         
        หวังว่ารักจริง หวังว่าเค้าจะไม่ทิ้ง
        หวังว่าเมื่อเจอใครที่เค้าดีกว่าแล้วเค้าจะไม่ปิ๊ง
        หารู้ไม่ว่าตอนมึงกะหนุงกะหนิง
        มีฆาตกรอยู่หลังประตูยืนซุ่มพร้อมมีดคมวิ้ง
         
        มันรอ ให้ความไม่แน่นอนเปิดประตูให้
        ส่วนต้นทางมีสัจธรรมคอยดูให้
        ปังตอ ในมือมันพร้อมทะลวงไส้
        โรคจิตพอจะไม่รีบร้อนไปฆ่าจนกว่าเวลาที่ใช่
         
        ใช่ คดีนี้รักเป็นแค่พยาน
        มีมึงเป็นเหยื่อ ความจริงเป็นตุลาการ
        มันคือยาเบื่อ ฆ่าทิ้งแล้วอันตรธาน
        มันคือความคาดหวังที่ใจเราสร้างเราดลบันดาลเอง
         
        ความคาดหวังนั้นคือยาพิษ
        มันกำลังไล่ฆาตกรรมเราอย่างซาดิสม์
        มึงไม่อาจจะหนีด้วยแจ๊สหรือว่ายาริส
        เพราะว่ามันจะตามล่ามึงเหมือนแสงอาทิตย์
         
        แต่ว่ามัน เป็นยาพิษที่เราสมัครใจกลืน
        หลักประหารที่เราสมัครใจยืน
        คิดว่ามันอบอุ่นเหมือนกับผิงไฟฟืน
        สุดท้ายแล้วความคาดหวัง
        กำลังเหนี่ยวไกปืน
         
        เมื่อตอนเด็ก ๆ มันชื่อว่าความหวัง
        เกิดจากใจบริสุทธิ์ที่ไม่เคยถูกขัง
        เป็นเด็กไร้เดียงสา ร่ำรวยอารมณ์ขัน
        มีความเชื่อมุ่งมั่นว่าจะตามหาความฝัน
         
        เริ่มต้นเดินทางตั้งแต่ตัวเลขซีโร่
        เริ่มเก็บเลเวล ค่อย ๆ มีเกราะ มีโล่ห์
        วันหนึ่งเจอเพื่อนที่มีชื่อว่าอีโก้
        บอกว่าถ้าอยากเจอฝันต้องฆ่าคู่แข่งด้วยอีโต้
         
        ความอิจฉาเป่าหู เชื่อป๋าสิหนู
        ถ้ายอมให้ใครวิ่งแซงมันน่าอับอายอดสู
        หยิบมีดขึ้นมา เอาคมถู ๆ
        แล้วกดบนคอหอยเหมือนกับเราเชือดหมู
         
        ฉึ่บ ฉับพลันความหวังก็มีเลือดท่วมกาย
        มันหลงลืมความฝันที่มันอยากเจอทักทาย
        กระหายหิวเลือด เหมือนอยากจิบไวน์
        เปลี่ยนชื่อเป็นความคาดหวัง
        ผู้หยิบยื่นความตาย
         
        ความคาดหวังนั้นคือยาพิษ
        มันกำลังไล่ฆาตกรรมเราอย่างซาดิสม์
        มึงไม่อาจจะหนีด้วยแจ๊สหรือว่ายาริส
        เพราะว่ามันจะตามล่ามึงเหมือนแสงอาทิตย์
         
        แต่ว่ามัน เป็นยาพิษที่เราสมัครใจกลืน
        หลักประหารที่เราสมัครใจยืน
        คิดว่ามันอบอุ่นเหมือนกับผิงไฟฟืน
        สุดท้ายแล้วความคาดหวัง
        กำลังเหนี่ยวไกปืน
         
        ความคาดหวังเหมือนการ์ตูนโดจิน
        ที่ใจเราสร้างเองตามสะดวกโยธิน
        เคยเลี้ยงไว้เป็นซามูไรแต่วันที่เป็นโรนิน
        มันจะจับเราเข้าลานประหารตัดหัวด้วยกิโยติน
         
        ก่อนฆ่ามันจะโบยตีจนลมหายใจรวยริน
        เอาความไว้ใจที่มึงให้ไปทำลายเป็นผงโรยดิน
        ให้มึงมองตอนที่หมามากิน
        ว่าความไว้ใจแล้วคาดหวังนี่มันเจ็บปวดจริง ๆ
         
        บางครั้งกูโดนมันยิง อาการร่อแร่
        แต่กูก็รอดมาได้ด้วยการคิดถึงพ่อแม่
        บางครั้งมันตามหลอกหลอน จนกูเกือบชีวิตพัง
        กูเลยสู้มันกลับด้วยการปลงอนิจจัง
         
        ก่อนฝังมัน เอาไว้ในบ่อ
        ให้การอภัยฉาบปูนแล้วค่อยเอาอิฐก่อ
        จบ end credit จะมีภาพมันแตกหน่อ
        เพราะคาดตะกอนจะกลับมาฆ่ามึงในหนังภาคต่อ
         
        ความคาดหวังนั้นคือยาพิษ
        มันกำลังไล่ฆาตกรรมเราอย่างซาดิสม์
        มึงไม่อาจจะหนีด้วยแจ๊สหรือว่ายาริส
        เพราะว่ามันจะตามล่ามึงเหมือนแสงอาทิตย์
         
        แต่ว่ามัน เป็นยาพิษที่เราสมัครใจกลืน
        หลักประหารที่เราสมัครใจยืน
        คิดว่ามันอบอุ่นเหมือนกับผิงไฟฟืน
        สุดท้ายแล้วความคาดหวัง
        กำลังเหนี่ยวไกปืน`,
        audio: '/upload/คาด-ตะ-กอน (Expecutioner).mp3',
        fav: 17321
    },
    {
        nameSong: "SRY - Ft. Maiyarap",
        imgSong: "https://kazz-magazine.com/wp-content/uploads/2019/06/61703373_2743983852295511_1865053071130755072_o-1-683x1024.jpg",
        type: "rap",
        lyric: `เธอบอกว่าไม่ต้องโทรกลับมา
        เธออยู่กับคนที่คอยเฝ้าดูจับตา
        ถ้าหากว่าฉันทำให้ทะเลาะกัน
        บอกเขาว่าช่างมันฉันแค่เมาขอโทษที
        I'm sorry baby baby baby I'm sorry
        I'm sorry baby baby baby I'm sorry
        I'm sorry baby baby baby I'm sorry
        I'm sorry baby I'm sorry baby

        ไม่ได้มาง้อรื้อเรื่องเก่าๆมาทบทวน
        และไม่ใช่ไม่รู้ว่าที่ฉันทำลงไปมันรบกวน
        ไม่สมควรและรู้แก่ใจ
        ว่ารักครั้งใหม่เธอโคตรดี
        คงทำให้เขาและเธอผิดใจ
        ที่ทำลงไปขอโทษที
        แต่ฉันไม่โชคดีเหมือนเธอที่เจอคนเข้าตา
        พยายามจะปล่อยจะวาง
        ก็ยังจะหยิบความเศร้ามา
        ไม่คิดจะเปิดใจกับใครต่อใครที่เข้ามา
        ยังจมกับเหล้ายา
        และตอนฉันเมาทีไรก็มีน้ำใสๆล้นเบ้าตา
        และที่ฉันโทรมาหาไม่ใช่ว่าอยากมีเรื่อง
        เพียงแต่ในหัวยังจำเบอร์เธอ
        ถึงแม้ว่าลบไปจากเครื่อง
        ได้ยินว่าเธอกับเขา
        ยังรักกันดีจากปากเพื่อน
        คืนนี้แค่อยากฟังเสียง
        เรื่องขอคืนดีไม่อาจเอื้อม

        เธอบอกว่าไม่ต้องโทรกลับมา
        เธออยู่กับคนที่คอยเฝ้าดูจับตา
        ถ้าหากว่าฉันทำให้ทะเลาะกัน
        บอกเขาว่าช่างมันฉันแค่เมาขอโทษที
        I'm sorry baby baby baby I'm sorry
        I'm sorry baby baby baby I'm sorry
        I'm sorry baby baby baby I'm sorry
        I'm sorry baby I'm sorry baby

        ขอโทษที่รบกวนเวลาหนุนตัก
        ฟังจากน้ำเสียงโมโหของเขา
        แล้วตอนนี้เขาคงฉุนจัด
        ประเดี๋ยวตอนสายตัด
        ความโกรธของเขาคงบรรเทา
        ฝากบอกเขาว่าไม่มีอะไร
        แฟนเก่าขี้แพ้แค่มันเมา
        แค่หัวใจมันสั่นเทาและเศร้าจนสั่นไหว
        แค่มันนั่งดูรูปคู่เก่าๆ
        แล้วคืนนี้มันเกิดหวั่นไหว
        แค่ไม่ว่าวันไหนๆ
        มันยังรักเธอและจมปลัก
        ได้โปรดให้เขาช่วยเห็นใจ
        ไอ้ควายตัวที่อกคงหัก
        อาการคงหนักเลยวิสาสะ
        มารบกวนยามวิกาล
        ขอโทษเขาด้วยที่กวนเวลา
        ตอนเขาและเธอจะฟังนิทาน
        เธอด่าว่าป่านนี้แล้ว
        จะโทรมาหาสวรรค์วิมาน
        ฉันตอบก็แค่ขี้เมาตาบอด
        ได้โปรดอย่าถือสาคนพิการ
        I'm sorry

        I'm sorry baby baby bae I'm sorry
        ขอโทษทีนะฉันเมาฉันเลยงี่เง่าไปอย่างนี้
        ถ้าหากเขาถามว่าฉันเป็นใคร
        ก็บอกเขาไปว่าฉันเป็นเพื่อนที่ยังซี้
        เหมือนที่เธอเคยโกหกฉัน
        ก็ทำอย่างนั้นแหล่ะคนดี
        I'm sorry baby baby bae I'm sorry
        ยังจมกับเรื่องของเรา
        ฉันเลยกินเหล้าอยู่แบบนี้
        ถ้าหากเธอถามโทรมาทำไม
        จะหาเหตุผลถ้านอกจากเมาคงไม่มี
        เหมือนที่เธอเคยทิ้งกันไป
        ไม่มีเหตุผลแหละคนดี

        ฉันมักจะใช้ไอ้คำว่าเมา
        เป็นยาบรรเทาอาการเจ็บ
        ทุกครั้งที่เมาชอบโทรหาเขา
        ทำตัวงี่เง่าอาการเด็ก
        ไม่รู้ฉันบ้าหรือหน้าฉันด้าน
        เป็นอันธพาลตอนรับประทานเสร็จ
        สรุปว่าเหล้ามันแดกกู
        ไม่ใช่กูแดกเหล้าแต่ไม่มีอาการเข็ด
        ทั้งๆที่อยากจะลืม
        แต่ทุกอึกที่กลืนแม่งกลับจำ
        ทั้งๆที่บอกจะไม่กวนตลอดไป
        แต่ไม่รู้ทำทำไมจึงกลับคำ
        ต้องกลืนทั้งเหล้ากลืนทั้งน้ำลายตัวเอง
        ส่วนเธอครื้นเครงอยู่กับมัน
        แล้วเธอเป็นไงสบายดี
        รบกวนแค่นี้ที่อยากฟัง
        ไม่รู้ว่าฉันคิดถึงหรือว่าฉันรับไม่ได้
        ไม่รู้ว่าฉันอิจฉาหรือว่ายินดีกับเธอไม่ไหว
        เธอไม่ต้องห่วงฉันไม่ได้โทรมา
        เพื่อเรียกร้องถึงความเห็นใจ
        เธอไม่จำเป็นต้องตอบสักคำ
        แค่เงียบแล้วฟังก่อนจะตัดสายไป

        เธอบอกว่าไม่ต้องโทรกลับมา
        เธออยู่กับคนที่คอยเฝ้าดูจับตา
        ถ้าหากว่าฉันทำให้ทะเลาะกัน
        บอกเขาว่าช่างมันฉันแค่เมาขอโทษที

        I'm sorry baby baby baby I'm sorry
        I'm sorry baby baby baby I'm sorry
        I'm sorry baby baby baby I'm sorry
        I'm sorry baby I'm sorry baby

        I'm sorry baby baby baby I'm sorry
        I'm sorry baby baby baby I'm sorry
        I'm sorry baby baby baby I'm sorry
        I'm sorry baby I'm sorry

        I'm sorry baby baby baby I'm sorry
        I'm sorry baby baby baby I'm sorry
        I'm sorry baby baby baby I'm sorry
        I'm sorry baby I'm sorry baby`,
        audio: '/upload/SRY.mp3',
        fav: 15741
    }
];

const songKang = [
    {
        nameSong: "รักเธอ 24 ชั่วโมง",
        imgSong: "https://s.mxmcdn.net/images-storage/albums5/0/9/5/3/7/4/33473590_350_350.jpg",
        type: "r&b",
        lyric: `ฉันลืมตาขึ้นมาในเวลาเช้า

                ถามใจที่เหงาเฝ้าคิดถึงใคร
                ภาพเธอก็ลอยมาแต่ไกล
                รีบดูนาฬิกาก็ได้เวลากดเบอร์โทรหาเธอ
                
                เที่ยงแล้วกินอะไรมันแค่อิ่มท้อง
                ถ้าให้อิ่มใจต้องคิดถึงเธอ
                ถึงมีวันไหนไม่ได้เจอ แค่ได้ยินเสียงเธอ
                มาเซย์ฮัลโหลโอเคสบายใจ

                ไม่ขอพลาดสักวินาทีที่ฉันหายใจ
                ก็ไม่คิดเผื่อใจให้คนไหน

                รักเธอคนนี้ 24 ชั่วโมงเช้าสายบ่ายเย็นก็ยัง I love you
                ไม่ว่าจะกินไม่ว่าจะนอนอะไรๆ ยังไงก็เถอะ
                หัวใจเปิดให้เธอ All day and night
                ให้เธอเข้ามานั่งนอนเดินข้างในใจ
                บอกใครต่อใครว่าใจข้างในฉันมีเจ้าของก็คือเธอ

                เลิกงานตอนตกเย็นมันก็เหนื่อยล้า
                เห็นหน้าเธอแล้วมันก็หายไป
                ทุกคืนเข้านอนตอนดับไฟ
                ฉันก็ยังเห็นเธอมาปรากฏตัวในฝันของฉันเลย

                ไม่ขอพลาดสักวินาทีที่ฉันหายใจ
                ก็ไม่คิดเผื่อใจให้คนไหน

                รักเธอคนนี้ 24ชั่วโมงเช้าสายบ่ายเย็นก็ยัง I love you
                ไม่ว่าจะกินไม่ว่าจะนอนอะไรๆ ยังไงก็เถอะ
                หัวใจเปิดให้เธอ All day and night
                ให้เธอเข้ามานั่งนอนเดินข้างในใจ
                บอกใครต่อใครว่าใจข้างในฉันมีเจ้าของก็คือเธอ

                Hey You Baby ใจลอยไปหาตลอดเวลาเลย Lady
                ฉันเฝ้าแต่เพ้อถึงเธอคนเดียวอยู่ทุกนาที I'm Cazy
                ไม่อาจจะลบไม่อาจจะเลือนใจมันสะเทือนเลย Baby
                ไม่เคยไม่คิดถึงเธอใจยังละเมออยู่ตรงนี้

                เพียงแค่เข็มนาฬิกายังเดินไป
                ยังมีเธอเข้าออกทุกวินาทีที่หายใจ
                ฝันถึงเธอทุกคืน Twenty-four Seven
                ฉันจะรักเธอไปจนตายจนรักใครไม่เป็น

                ไม่ขอพลาดสักวินาทีที่ฉันหายใจ
                ก็ไม่คิดเผื่อใจให้คนไหน

                รักเธอคนนี้ 24 ชั่วโมงเช้าสายบ่ายเย็นก็ยัง I love you
                ไม่ว่าจะกินไม่ว่าจะนอนอะไรๆ ยังไงก็เถอะ
                หัวใจเปิดให้เธอ All day and night
                ให้เธอเข้ามานั่งนอนเดินข้างในใจ
                บอกใครต่อใครว่าใจข้างในฉันมีเจ้าของก็คือเธอ

                รักเธอคนนี้ 24 ชั่วโมงเช้าสายบ่ายเย็นก็ยัง I love you
                ไม่ว่าจะกินไม่ว่าจะนอนอะไรๆ ยังไงก็เถอะ
                หัวใจเปิดให้เธอ All day and night
                ให้เธอเข้ามานั่งนอนเดินข้างในใจ
                บอกใครต่อใครว่าใจข้างในฉันมีเจ้าของก็คือเธอ`,
        audio: '/upload/รักเธอ 24 ชั่วโมง.mp3',
        fav: 21658
    },
    {
        nameSong: "คุณและคุณเท่านั้น",
        imgSong: "https://f.ptcdn.info/082/007/000/1373434588-BOyRJHECQA-o.jpg",
        type: "pop",
        lyric: `เห็นใครใครเขาบอกว่าคนน่ารักชอบเอาแต่ใจ
                เห็นใครใครก็บอกว่าคนสวยสวยเจ้าชู้จะตาย
                ผมได้ฟังบ่อยบ่อยเริ่มกลัวเสียแล้วก็เลยปิดตัว
                ผมนั้นยังไม่พร้อมจะเอาอะไรมาปวดหัว

                ตั้งแต่วันที่คุณเดินเข้ามา (โอ)
                วันที่เราได้นั่งมองตา (โอ๊ะโอ)
                ก็บอกหัวใจเอาไว้ว่าอยากลองอีกสักครั้ง (โอ๊ะโอ)
                If you wanna be my baby (โอ)
                If you wanna be my girl (โอ๊ะโอ)
                ช่วยบอกให้ผมมั่นใจว่าจะไม่ไปไหน (โอ๊ะโอ)

                ก็คงเป็นคุณเท่านั้นที่ทำให้ใจผมหยุดเหงา
                ก็มีแต่คุณเท่านั้นที่ทำให้ใจผมคลายเศร้า
                คงไม่มีโอกาสถ้าคุณไม่ให้โอกาส
                คงจะต้องทำพลาดอีกครั้งหนึ่ง

                ก็ผมน่ะเจอมาบ่อยที่เข้ามาคบแล้วก็จากไป
                ผมน่ะโดนมาบ่อยเรื่องตกหลุมรักคนใจร้าย
                เหมือนจะโดนคำสาปให้มีแต่รักที่ต้องปวดใจ
                เหมือนจะโดนจนเข็ดแต่ยังไม่วายอยากมีไว้

                ตั้งแต่วันที่คุณเดินเข้ามา (โอ)
                วันที่เราได้นั่งมองตา (โอ๊ะโอ)
                ก็บอกหัวใจเอาไว้ว่าอยากลองอีกสักครั้ง (โอ๊ะโอ)
                If you wanna be my baby (โอ)
                And if you wanna be my girl (โอ๊ะโอ)
                ช่วยบอกให้ผมมั่นใจว่าจะไม่ไปไหน (โอ๊ะโอ)

                ก็คงเป็นคุณเท่านั้นที่ทำให้ใจผมหยุดเหงา
                ก็มีแต่คุณเท่านั้นที่ทำให้ใจผมคลายเศร้า
                คงไม่มีโอกาสถ้าคุณไม่ให้โอกาส
                คงจะต้องทำพลาดอีกครั้งหนึ่ง

                ก็ตั้งแต่วันที่คุณเดินเข้ามา (โอ)
                และวันที่เราได้นั่งมองตา (โอ๊ะโอ)
                ก็บอกหัวใจเอาไว้ว่าอยากลองอีกสักครั้ง (โอ๊ะโอ)
                If you wanna be my baby (โอ)
                And if you wanna be my girl (โอ๊ะโอ)
                ช่วยบอกให้ผมมั่นใจว่าจะไม่ไปไหน (โอ๊ะโอ)

                ก็คงเป็นคุณเท่านั้นที่ทำให้ใจผมหยุดเหงา
                ก็มีแต่คุณเท่านั้นที่ทำให้ใจผมคลายเศร้า
                คงไม่มีโอกาสถ้าคุณไม่ให้โอกาส
                คงจะต้องทำพลาดอีกครั้งหนึ่ง

                ก็คงเป็นคุณเท่านั้นที่ทำให้ใจผมหยุดเหงา
                เป็นคุณและคุณเท่านั้นที่ทำให้ใจผมคลายเศร้า
                คงไม่มีโอกาสถ้าคุณไม่ให้โอกาส
                คงจะต้องทำพลาดอีกครั้งหนึ่ง (ครั้งหนึ่ง)`,
        audio: '/upload/คุณและคุณเท่านั้น.mp3',
        fav: 19963
    },
    {
        nameSong: "ใจสลายฮะมุง(Heartbreaker)",
        imgSong: "https://i.ytimg.com/vi/zvyEGzPPNxQ/maxresdefault.jpg",
        type: "pop",
        lyric: `ใจผมมันสลายจนกลายเป็นฝุ่นเลยฮะมุง
                ตอนแรกก็คิดว่าใช่สุดท้ายน้ำตาเป็นกระบุง
                เธอเข้ามาบอกว่ารัก Ay เข้ามาทำให้หลง
                สุดท้ายเธอไปกับเขามันเศร้ากว่าตอนเห็นหน้าลุง
                
                ก็เธอเป็นคนเจ้าชู้ ชู้ ชู้ ชู้
                แถวบ้านผมเรียกขี้จุ๊ จุ๊ จุ๊ จุ๊
                ก็เธอเป็นคนเจ้าชู้ ชู้ ชู้ ชู้
                แถวบ้านผมเรียกขี้ตู่ ตู่ ตู่ ตู่ Alright alright
                
                ให้เธอไปเลยหมดใจ
                ไวไวเลยไม่ได้ทันกรอง
                น่ารักจนใจมันหวั่นไหว
                ไอ้ด้านร้ายๆ เลยไม่ได้ทันมอง
                
                เธอยิ่งกว่า วันๆ To the ทองๆ
                น้ำตามันเลยนองๆ
                เป็นสายและก็ฟองๆ
                สุดท้ายนอนกอด Bong bong like ooh
                
                หลงไปคำหวานๆ จนใจมันโลภ
                ใจมันไม่ทันระวังยังไม่มีโล่
                รู้ตัวอีกทีวันนี้โดนรีไซเคิล
                คนเดียวไม่ชอบเพราะเธอ เบิ้ล เบิ้ล
                
                ใจผมมันสลายจนกลายเป็นฝุ่นเลยฮะมุง
                ตอนแรกก็คิดว่าใช่สุดท้ายน้ำตาเป็นกระบุง
                เธอเข้ามาบอกว่ารัก Ay เข้ามาทำให้หลง
                สุดท้ายเธอไปกับเขามันเศร้ากว่าตอนเห็นหน้าลุง
                
                ก็เธอเป็นคนเจ้าชู้ ชู้ ชู้ ชู้
                แถวบ้านผมเรียกขี้จุ๊ จุ๊ จุ๊ จุ๊
                ก็เธอเป็นคนเจ้าชู้ ชู้ ชู้ ชู้
                แถวบ้านผมเรียกขี้ตู่ ตู่ ตู่ ตู่ Ok Ok
                
                เธอมันเจ้าชู้ แต่ดูไม่ออก
                เล่นอยู่กับไฟทำไมเพื่อนไม่บอกอะ
                เธอมันชีกอ ไม่ทันรีรอ
                เห็นว่าใสใสข้างในดันมีตอ
                
                เธอบอกว่ารัก บอกว่าคิดถึง
                เงินเลยบินไปหลายบาทหลายสลึงเลย
                พาไปกินข้าว ไอ้ต้าวไปเดินห้าง
                แสนสดชื่นแต่ตื่นมาเธอทิ้งขว้าง
                
                วาร์ปมา Skrt รถขยะ
                พี่แม่งโคตรเท่ แต่โดนเทเหมือนสวะ
                เหมือนดูเมะโดเรม่อนที่ไม่มีโนบิตะ
                ไม่มันสนุก มุง เก็ต ใช่ปะ Ya ya ya
                
                อย่า อย่า เธออย่ายิ้ม
                ถ้าไม่อยากเจ็บจริง
                ไปน่ารักไกลๆเดี๋ยวของมันขึ้น
                แล้วจะบรรลัยนะ Bye bye bye
                
                ใจผมมันสลายจนกลายเป็นฝุ่นเลยฮะมุง
                ตอนแรกก็คิดว่าใช่สุดท้ายน้ำตาเป็นกระบุง
                เธอเข้ามาบอกว่ารัก Ay เข้ามาทำให้หลง
                สุดท้ายเธอไปกับเขามันเศร้ากว่าตอนเห็นหน้าลุง
                
                ก็เธอเป็นคนเจ้าชู้ ชู้ ชู้ ชู้
                แถวบ้านผมเรียกขี้จุ๊ จุ๊ จุ๊ จุ๊
                ก็เธอเป็นคนเจ้าชู้ ชู้ ชู้ ชู้
                แถวบ้านผมเรียกขี้ตู่ ตู่ ตู่ ตู่ Ya ya
                
                ใจผมมันสลายจนกลายเป็นฝุ่นเลยฮะมุง
                ตอนแรกก็คิดว่าใช่สุดท้ายน้ำตาเป็นกระบุง
                เธอเข้ามาบอกว่ารัก Ay เข้ามาทำให้หลง
                สุดท้ายเธอไปกับเขามันเศร้ากว่าตอนเห็นหน้าลุง Ya ya`,
        audio: '/upload/ใจผมสลายฮะมุง (HEARTBREAKER).mp3',
        fav: 17892
    },
    {
        nameSong: "โตมาดี (TOMADEI)",
        imgSong: "https://i.ytimg.com/vi/qzzfaj6PvKk/maxresdefault.jpg",
        type: "pop",
        lyric: `ดูทรงอย่างเธอ รู้เลยว่าโตมาดี
                ยิ่งมองยิ่งดู อู้ว เธอยิ่งโตยิ่งดี
                อยากให้เธอลองรักกันดูสักที
                ถึงแม้ว่าพี่จะดูร้ายร้าย
                แต่ไม่ทำให้ You Cry Cry
                
                นั่งมองเธออะอยู่ตั้งนาน
                หลงละเมอในความงดงาม
                เธอคือแสงสว่าง
                ออร่าของน้องมันแรงจัด ay
                สวยแบบนี้ใครใครก็มอง
                อยากเอาป้ายไปแขวนว่าจอง
                น่าทะนุถนอม
                อยากลองไปถามเธอสักนิด ay
                
                พ่อแม่หนูเลี้ยงมายังไง
                ที่บ้านให้กินอะไรทำไมถึงดูดีอย่างงี้
                Style ก็ดูแพง แรงแบบพอดี
                อย่างนี้ไม่ใจบางได้ไง
                
                ดูทรงอย่างเธอ รู้เลยว่าโตมาดี
                ยิ่งมองยิ่งดู อู้ว เธอยิ่งโตยิ่งดี
                อยากให้เธอลองรักกันดูสักที
                ถึงแม้ว่าพี่จะดูร้ายร้าย
                แต่ไม่ทำให้ You Cry Cry
                
                ดูทรงอย่างเธอ รู้เลยว่าโตมาดี
                ยิ่งมองยิ่งดู อู้ว เธอยิ่งโตยิ่งดี
                อยากให้เธอลองรักกันดูสักที
                ถึงแม้ว่าพี่จะดูร้ายร้าย
                แต่ไม่ทำให้ You Cry Cry
                
                หน้าใสใสทำใจพี่ ตึกตั๊ก
                ยิ้มแบบนี้มีแรงเลย คึกคัก
                
                ตกหลุมรักมันยังจะน้อยไป
                เหมือนตกเหว Scale รูปหัวใจ
                Filter ฟรุ้งฟริ้งเรื่องจริงหรือฝันไป
                ศพสีชมพูเห้ยกูเป็นอะไร What
                ใจพี่กระชุ่มและกระชวย
                น้องคือยอดหญิงพี่พูดจริงไม่ได้อวย
                ขอไลน์ได้ไหมถ้านวลน้องจะอำนวย
                ถูกใจวัยโจ๋ Don't Say No นะคนสวย
                อย่า อย่า งูที่เอวพี่เร็วกว่าใคร
                Gucci Belt เดี๋ยวพี่จัดให้
                โฉนดที่ดินจะเอากี่ไร่
                เงินพี่หามาเองพี่ไม่ได้ขอตังค์ใคร
                
                หนูดุไหม พี่อะโคตรไหว
                ถึงหนูจะเอาแต่ใจ
                จะตามใจ What You Need
                พ่อล่ะดุไหม อันนี้พี่ก็ไหว
                พนมมือไหว้คุณพ่อสัก3ที
                
                ดูทรงอย่างเธอ รู้เลยว่าโตมาดี
                ยิ่งมองยิ่งดู อู้ว เธอยิ่งโตยิ่งดี
                อยากให้เธอลองรักกันดูสักที
                ถึงแม้ว่าพี่จะดูร้ายร้าย
                แต่ไม่ทำให้ You Cry Cry
                
                ดูทรงอย่างเธอ รู้เลยว่าโตมาดี
                ยิ่งมองยิ่งดู อู้ว เธอยิ่งโตยิ่งดี
                อยากให้เธอลองรักกันดูสักที
                ถึงแม้ว่าพี่จะดูร้ายร้าย
                แต่ไม่ทำให้ You Cry Cry
                
                แรกๆ เจอกันทักทาย
                สบายดีป่าวครับน้องสาว
                ขาวๆ ได้ใจใช้ครีมไร
                ให้พี่ใช้บ้างได้เปล่า
                บ่ายๆ สายๆ หนูจะไปไหน
                ไลน์บอกพี่บ้างน้า ถ้าไม่มีใคร
                ดูแล เทคแคร์เดี๋ยวพี่จะไปหา
                Magic Magic หนูมี Magic
                ทำพี่หลงไหล My Heart มันเซไป
                น้องสาวบอกที ว่าพี่นั้น มีสิทธิ์
                แค่คิดถึงหนูหนะ พี่พอมีไหม
                (Missing You)
                พี่ติดน้อง ยิ่งกว่าพี่หนะติด Game
                พี่จะไม่พาน้องไปผิด Lane
                จะมีแต่เรื่องให้น้องนั้น ตื่นเต้น
                ทำเป็นเล่น ใจเย็นๆ
                
                Let's Get It Get It Get It
                ตอนน้องเต้นหนะช็อตเด็ดใจเย็น
                ใจเย็น ใจเย็น ของจริงพี่ไม่ได้มาเล่นๆ
                ฝากบอกคุณ แม่ แม่ แม่ แม่
                พี่พร้อมเทคแคร์ ไม่อยากเป็นแค่ฝัน
                ไม่ได้มาหลอกน้อง
                แค่มาบอก ความในใจ
                
                ดูทรงอย่างเธอ รู้เลยว่าโตมาดี
                ยิ่งมองยิ่งดู อู้ว เธอยิ่งโตยิ่งดี
                อยากให้เธอลองรักกันดูสักที
                ถึงแม้ว่าพี่จะดูร้ายร้าย
                แต่ไม่ทำให้ You Cry Cry
                
                ดูทรงอย่างเธอ รู้เลยว่าโตมาดี
                ยิ่งมองยิ่งดู อู้ว เธอยิ่งโตยิ่งดี
                อยากให้เธอลองรักกันดูสักที
                ถึงแม้ว่าพี่จะดูร้ายร้าย
                แต่ไม่ทำให้ You Cry Cry
                
                ดูทรงอย่างเธอ รู้เลยว่าโตมาดี
                ยิ่งมองยิ่งดู อู้ว เธอยิ่งโตยิ่งดี
                อยากให้เธอลองรักกันดูสักที
                ถึงแม้ว่าพี่จะดูร้ายร้าย
                แต่ไม่ทำให้ You Cry Cry Ay`,
        audio: '/upload/โตมาดี (TOMADEI).mp3',
        fav: 16984
    },
    {
        nameSong: "แค่เรา [เพลงจากละคร เวลากามเทพ]",
        imgSong: "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSLct3H8lHIzsxxb-cU_3HKaTTUDIEa1ZI3eLDs0TNPZoZ9cXzyimbo4-jx9ND5l8gUxSw&usqp=CAU",
        type: "pop",
        lyric: `ก็ยังใช้ชีวิตเหมือนเคย
        ยังเฉยๆ และไม่ได้หวั่นไหว กับเรื่องไหน
        จังหวะของหัวใจก็ยังเต้นธรรมดา
        
        แต่พอมาวันนี้เจอเธอ
        เล่นน็อกใจฉันแทบเบลอ
        ก็ใจมันเริ่มสั่น ข้างในมันไหวหวั่น
        เพราะเพียงสายคู่นั้น
        
        ก็หัวใจมันไปมันเต้นมันรัวมันดัง
        ห้ามใจเอาไว้แต่ใจมันก็ไม่ฟัง
        ลอยไปแล้ว อยู่กับเธอทั้งใจแค่ได้สบตา
        
        สมองไม่มีแรง ที่จะไปสั่งหัวใจ
        เหมือนไม่มีใคร รอบกายมีเพียงแค่เรา
        เสียงจากใจ มองตากันแล้วฟังในภวังค์ที่มีแค่เรา
        มีแค่เรา
        
        เธอเล่นซะใจฉันไหวหวั่น
        แต่มองก็รู้ว่าเธอเป็นเหมือนกัน
        ข้างนอกนิ่งไว้ข้างในแทบสนั่น
        เหมือนเราเป็นเสาเข็มแล้วเธอเป็นปั้นจั่น
        
        ตอกลงมากลางกล่องดวงใจ
        เธอมีเสน่ห์ไม่เหมือนใคร
        หยุดเวลาเอาไว้และไม่ให้ใครมาเอี่ยว
        เธอคือคนที่ตามหา สัญญาเอาก้อยเกี่ยวเลย
        
        เพราะที่ในวันนี้เจอเธอ
        เล่นน็อกใจฉันแทบเบลอ
        ก็ใจมันเริ่มสั่น ข้างในมันไหวหวั่น
        เพราะเพียงสายคู่นั้น
        
        ก็หัวใจมันไปมันเต้นมันรัวมันดัง
        ห้ามใจเอาไว้แต่ใจมันก็ไม่ฟัง
        ลอยไปแล้ว อยู่กับเธอทั้งใจแค่ได้สบตา
        
        สมองไม่มีแรง ที่จะไปสั่งหัวใจ
        เหมือนไม่มีใคร รอบกายมีเพียงแค่เรา
        เสียงจากใจ มองตากันแล้วฟังในภวังค์ที่มีแค่เรา
        มีแค่เรา มีแค่เรา มีแค่เรา
        
        ก็หัวใจมันไปมันเต้นมันรัวมันดัง
        ห้ามใจเอาไว้แต่ใจมันก็ไม่ฟัง
        ลอยไปแล้ว อยู่กับเธอทั้งใจแค่ได้สบตา
        
        สมองไม่มีแรง ที่จะไปสั่งหัวใจ
        เหมือนไม่มีใคร รอบกายมีเพียงแค่เรา
        เสียงจากใจ มองตากันแล้วฟังในภวังค์ที่มีแค่เรา`,
        audio: '/upload/แค่เรา.mp3',
        fav: 18964
    },
    {
        nameSong: "ดีไม่พอ (REAL ME)",
        imgSong: "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQ7bUGrCgasypCyeTvsmMHPFo49qHwok68kww&usqp=CAU",
        type: "pop",
        lyric: `ถ้าฉันนั้นมันเลวร้าย มันไม่ได้ดั่งใจ
        ก็ไม่ต้องยื้อฉันไว้ อย่า อย่า
        ถ้าเธออยากได้แบบเขา ก็ให้คำว่าเรา
        มันจบไปดีกว่า นะ นะ
        ฉันทำดีที่สุดแล้ว ถ้ายังดีไม่พอ
        เธอก็ไม่ต้องรอ อย่า อย่า
        ถ้าเธออยากได้แบบเขา ก็ให้คำว่าเรา
        มันจบไปดีกว่า นะ นะ
        
        อยู่ดีดีก็เกิดคำถาม
        ว่าวันนี้ฉันทำอะไรอยู่
        กลายเป็นใครแล้วก็ไม่รู้
        เปลี่ยนตัวเองเพื่อเธอมากเกินไป
        
        แต่เปลี่ยนยังไงเธอก็เหมือนเดิม
        เธอยังคงซ้ำเติมเวลาโกรธ
        เอาแต่โทษว่าฉันไม่ดี
        ทำไมไม่เป็นเหมือนที่ต้องการ
        
        เธอบอกให้ฉันนั้นเป็นอย่างคนนั้น
        เธอบอกให้ฉันทำอย่างคนนี้
        เธอบอกว่าคนอย่างฉันมันไม่ดี
        แบบนี้คงทนไม่ไหว
        เธอบอกว่าเธอไปรักใครก็ได้
        เธอบอกว่าเธอนั้นทิ้งฉันง่ายงาาย
        เธอบอกเธอไม่ต้องรักฉันก็ได้
        ถ้าฉันยังดีไม่พอ ok
        
        ถ้าฉันนั้นมันเลวร้าย มันไม่ได้ดั่งใจ
        ก็ไม่ต้องยื้อฉันไว้ อย่า อย่า
        ถ้าเธออยากได้แบบเขา ก็ให้คำว่าเรา
        มันจบไปดีกว่า นะ นะ
        ฉันทำดีที่สุดแล้ว ถ้ายังดีไม่พอ
        เธอก็ไม่ต้องรอ อย่า อย่า
        ถ้าเธออยากได้แบบเขา ก็ให้คำว่าเรา
        มันจบไปดีกว่า นะ นะ
        
        โดนเปรียบเทียบเคียงกับใคร
        เป็นให้ไม่ได้ก็ไป ay
        
        เคเคเค ไม่ต้องลังเล
        ถ้าเธอไม่ไหวอยากจะไปก็แค่ say bye
        เจ็บแต่ไม่ตายดีกว่ากลายเป็นคนอื่น
        เป็นคนในฝันไม่ละกันฉันขอตื่น
        Bcoz It's a realife
        imma fight for the realsh*t
        เจอกันตรงกลางนี่แหละทางแก้ของชีวิต
        คำที่เธอว่าด่าทอลองเก็บไปคิด
        สักนิดว่าฉันก็มีหัวใจ
        
        ถ้าฉันนั้นมันเลวร้าย มันไม่ได้ดั่งใจ
        ก็ไม่ต้องยื้อฉันไว้ อย่า อย่า
        ถ้าเธออยากได้แบบเขา ก็ให้คำว่าเรา
        มันจบไปดีกว่า นะ นะ
        ฉันทำดีที่สุดแล้ว ถ้ายังดีไม่พอ
        เธอก็ไม่ต้องรอ อย่า อย่า
        ถ้าเธออยากได้แบบเขา ก็ให้คำว่าเรา
        มันจบไปดีกว่า นะ นะ
        
        เอาแต่ย้ำเอาแต่ซ้ำว่าฉันไม่ดี
        โคตรผิดหวังที่ต้องมารักคนแบบนี้
        ต้องดีแค่ไหนถึงพอใจช่วยบอกฉันที
        โอ้ ฉันดีไม่พอเธอบอกฉันดีไม่พอ
        
        เอาแต่ย้ำเอาแต่ซ้ำว่าฉันไม่ดี
        โคตรผิดหวังที่ต้องมารักคนแบบนี้
        ต้องดีแค่ไหนถึงพอใจช่วยบอกฉันที
        ถ้าฉันดีไม่พอเธอไม่ต้องมารอแล้ว
        
        ถ้าฉันนั้นมันเลวร้าย มันไม่ได้ดั่งใจ
        ก็ไม่ต้องยื้อฉันไว้ อย่า อย่า
        ถ้าเธออยากได้แบบเขา ก็ให้คำว่าเรา
        มันจบไปดีกว่า นะ นะ
        ฉันทำดีที่สุดแล้ว ถ้ายังดีไม่พอ
        เธอก็ไม่ต้องรอ อย่า อย่า
        ถ้าเธออยากได้แบบเขา ก็ให้คำว่าเรา
        มันจบไปดีกว่า นะ นะ
        
        ถ้าฉันนั้นมันเลวร้าย มันไม่ได้ดั่งใจ
        ก็ไม่ต้องยื้อฉันไว้ อย่า อย่า
        ถ้าเธออยากได้แบบเขา ก็ให้คำว่าเรา
        มันจบไปดีกว่า นะ นะ
        ฉันทำดีที่สุดแล้ว ถ้ายังดีไม่พอ
        เธอก็ไม่ต้องรอ อย่า อย่า
        ถ้าเธออยากได้แบบเขา ก็ให้คำว่าเรา
        มันจบไปดีกว่า นะ นะ`,
        audio: '/upload/ดีไม่พอ (REAL ME).mp3',
        fav: 18964
    },
    {
        nameSong: "ติดรึยัง (FMY)",
        imgSong: "https://i.ytimg.com/vi/cCcpWQMnraw/sddefault.jpg",
        type: "pop",
        lyric: `อยู่กับเธอมานาน คอยดูแลและบริการ
        อยู่ใกล้ๆ ไม่เคยไปไหน
        I'm ok I'm still alright
        Baby เจอ ทุกวัน
        ตอนกินข้าวก็กินด้วยกัน
        บางทีเธอก็โดนมือฉัน
        แม้เราจะเป็นแค่เพื่อนกัน
        
        แต่มาวันนี้ เธอมีอาการ
        ที่ไม่เคยมี ไม่ค่อยจะดีเลย
        หวั่นใจเหลือเกิน หรือมีไข้ไม่สบาย
        บอกได้ไหม อย่าให้ฉันคิดไปเอง
        
        ติดหรือยัง สรุปติดหรือยัง
        เธอช่วยพูดให้ฟังได้ไหม ที่เธอเป็นนั้นคืออะไร
        สรุปติดหรือยัง จีบเธอติดหรือยัง
        เธอช่วยพูดให้ฟังได้ไหม
        ที่เธอชอบยิ้มให้เคอะเขิน
        
        มันคือ ติด ติด หรือยัง
        ติด ติด หรือยัง
        สรุปจีบติดหรือยัง
        จีบติดหรือยัง เธอ
        ติด ติด หรือยัง
        ติด ติด หรือยัง
        สรุปจีบติดหรือยัง
        จีบติดหรือยัง เธอ
        
        เธอคือคนสุดท้าย
        Oh be my love forever
        Never say never try to show
        How I love you
        ถ้าเธอไม่คิดอะไรเลยก็ยังทำเหมือนเคยๆ
        แต่วันนี้อะไรเอ่ย เธอมันเคยก็ใช่เลย
        
        เธอเองก็รู้ดี จีบเธอมาตั้งนาน
        ทำทุกทาง เลยนะคนดี
        คอยดูแลและคอยเอาใจใส่
        เธอไม่เคยมีอาการอยู่ตั้งนาน แล้วนี่อะไร
        
        หรือว่าเธอไม่สบาย เลยเข้ามาใกล้
        ทำให้ใจฉันมันวุ่นวาย
        บอกทีได้ไหม เธอยิ้มให้มาแบบนี้
        Oh baby can I call your mine
        
        ติดหรือยัง สรุปติดหรือยัง
        เธอช่วยพูดให้ฟังได้ไหม
        ที่เธอเป็นนั้นคืออะไร
        สรุปติดหรือยัง จีบเธอติดหรือยัง
        เธอช่วยพูดให้ฟังได้ไหม
        ที่เธอชอบยิ้มให้เคอะเขิน
        
        มันคือ ติด ติด หรือยัง
        ติด ติด หรือยัง
        สรุปจีบติดหรือยัง
        จีบติดหรือยัง เธอ
        ติด ติด หรือยัง
        ติด ติด หรือยัง
        สรุปจีบติดหรือยัง
        จีบติดหรือยัง เธอ
        
        เป็นแฟนกันได้ยังเธอ`,
        audio: '/upload/ติดรึยัง (FMY).mp3',
        fav: 17755
    }
];

const songPatrick = [
    {
        nameSong: "คนไกล",
        imgSong: "https://i.ytimg.com/vi/-BOtfXCIDcs/maxresdefault.jpg",
        type: "r&b",
        lyric: `ยืนมองดวงอาทิตย์ลับฟ้าไป
                ภายในใจ
                ได้แต่คิดถึงเธออยู่ตรงนี้
                ตัวเธออยู่ตรงนั้นเป็นไงบ้าง
                เมื่อดวงจันทร์ขึ้นมาบนฟ้าเธอรู้สึกอย่างไร

                ก็มันนานแล้วที่ไม่ได้เจอได้แต่เพ้อคิดถึงหน้าเธอ
                วันเวลาจะผ่านไปไม่ว่านานเท่าไรก็ยังมีแค่เธอคนเดียว
                และไม่ว่าใครจะเข้ามาฉันก็
                ไม่เคยจะสนใจ

                คิดถึงเธอเวลาตื่นตอนเช้า
                คิดถึงเธอเวลาอากาศมันหนาว
                กลัวว่าเธอจะเปลี่ยนไปในวันที่สองเรานั้นต้องไกล
                ฉันขอสักอย่างจะได้ไหม
                
                ลองมองขึ้นไปบนฟ้าเธอจะเห็นดวงดาวมากมาย
                อยู่กระจัดกระจาย
                ไปทุกทางและทุกแห่งหน
                มองขึ้นไปบนฟ้าเธอจะเห็น
                ว่ามีดาวอยู่ดวงหนึ่ง
                เฉิดฉายมีแสงสว่างยิ่งกว่าใคร

                ลองมองขึ้นไปบนฟ้าเธอจะเห็นดวงดาวของเธอ
                เป็นตัวแทนของฉันในวันที่เรานั้นต้องห่างไกล
                ทำให้เธอได้รู้ว่าตัวฉัน ไม่เคยจะไปไหน
                แค่ขอให้เธอมองขึ้นไปบนฟ้า
                มองไปที่ดาวของเรา

                Oh baby อยากจะรู้ตอนนี้เธอทำอะไร
                เธออยู่ที่ไหนกับใคร
                Cause baby ฉันมันคนชอบคิดมากเกินไป
                หวงเธอเกินไป
                แต่ก็ทำอะไรไม่ได้จริงจริง
                ในเมื่อใจข้างในของฉันมันคงต้องการจริงจริง

                คิดถึงเธอเวลาตื่นตอนเช้า
                คิดถึงเธอเวลาอากาศมันหนาว
                กลัวว่าเธอจะเปลี่ยนไปในวันที่สองเรานั้นต้องไกล
                ฉันขอสักอย่างจะได้ไหม

                ลองมองขึ้นไปบนฟ้าเธอจะเห็นดวงดาวมากมาย
                อยู่กระจัดกระจาย
                ไปทุกทางและทุกแห่งหน
                มองขึ้นไปบนฟ้าเธอจะเห็น
                ว่ามีดาวอยู่ดวงหนึ่ง
                เฉิดฉายมีแสงสว่างยิ่งกว่าใคร

                ลองมองขึ้นไปบนฟ้าเธอจะเห็นดวงดาวของเธอ
                เป็นตัวแทนของฉันในวันที่เรานั้นต้องห่างไกล
                ทำให้เธอได้รู้ว่าตัวฉัน
                ไม่เคยจะไปไหน
                แค่ขอให้เธอมองขึ้นไปบนฟ้า
                มองไปที่ดาวของเรา`,
        audio: '/upload/คนไกล.mp3',
        fav: 24987
    },
    {
        nameSong: "Lavender (ลาเวนเดอร์)",
        imgSong: "https://i0.wp.com/mereview.in.th/wp-content/uploads/2021/11/LAVENDER_PR_.jpg?fit=2000%2C2000&ssl=1",
        type: "r&b",
        lyric: `หากจะบอกว่าเธอทำให้ฉันเป็นคนใหม่
                บอกว่าชีวิตของฉันได้เปลี่ยนไป
                บอกว่าดอกไม้ในใจฉันให้เธอ ไปแล้ว
                
                ไม่เคยคิดว่ารักของเราจำกัดเวลา
                ฉันไม่เคยได้เตรียมใจ
                ทุกๆ สิ่งเมื่อเรานั้นได้มันมา
                ท้ายที่สุดทำไมต้องเสียไป
                ในวันนี้เธอมาพร้อมเหตุผลตั้งมากมายที่จะไป
                
                แต่ก่อนเธอจะไปขอร้องเธออีกครั้ง
                และหากมันจำเป็นสำหรับเธอขนาดนั้น
                ให้ฉันได้โอบกอด เหมือนว่ายังรักกัน
                ก่อนที่เธอจะหายไปตลอดกาล
                
                และถ้าเธอจะไปขอร้องเธออีกครั้ง
                หากมันจำเป็นสำหรับเธอขนาดนั้น
                ให้ฉันได้โอบกอด เหมือนว่ายังรักกัน
                ก่อนที่ฉันจะไม่มีเธออีกแล้ว จะไม่ขออะไรอีก
                
                แต่ก่อนนี้ ไม่ได้คิดว่าการกระทำของฉันจะทำเธอเจ็บชํ้า
                ไม่เคยระวังคำพูดแรงๆ ที่อาจจะทำเธอบอบชํ้าเท่าไร
                ให้เธอต้องเสียใจ แบบไม่มีวันจะย้อนคืนกลับมา
                
                ไม่เคยคิดว่ารักของเราจำกัดเวลา
                ฉันไม่เคยได้เตรียมใจ
                ทุกๆ สิ่งเมื่อเรานั้นได้มันมา
                ท้ายที่สุดทำไมต้องเสียไป
                ในวันนี้เธอมาพร้อมเหตุผลตั้งมากมายที่จะไป
                
                แต่ก่อนเธอจะไปขอร้องเธออีกครั้ง
                และหากมันจำเป็นสำหรับเธอขนาดนั้น
                ให้ฉันได้โอบกอด เหมือนว่ายังรักกัน
                ก่อนที่เธอจะหายไปตลอดกาล
                
                และถ้าเธอจะไปขอร้องเธออีกครั้ง
                หากมันจำเป็นสำหรับเธอขนาดนั้น
                ให้ฉันได้โอบกอด เหมือนว่ายังรักกัน
                ก่อนที่ฉันจะไม่มีเธออีกแล้ว จะไม่ขออะไรอีก`,
        audio: '/upload/Lavender (ลาเวนเดอร์).mp3',
        fav: 25301
    },
    {
        nameSong: "จันทร์อังคารพุธพฤหัสศุกร์เสาร์อาทิตย์ (Everyday)",
        imgSong: "https://i.ytimg.com/vi/fk-ICHELKSc/mqdefault.jpg",
        type: "r&b",
        lyric: `ไม่รู้ทำไม ทุกครั้งที่ตื่นมาตอนเช้า
                สิ่งๆ แรกที่ฉันนั้นคิด
                The only thing I think about is you
                อาจจะฟังดูไม่ค่อยดี But it's true
                
                วันจันทร์ฉันคิดถึงเธออยู่
                วันอังคารไปหาได้ไหม
                หากวันพุธเธอต้องตื่นเช้า
                เดี๋ยวไปเจอตอนกลางคืนก็ได้ เดี๋ยวจะรอ
                พฤหัสศุกร์เธออยู่ไหน
                เสาร์อาทิตย์อยู่ด้วยกันไหม
                อยากเจอทุกวัน อยากเจอทุกวัน
                
                ไม่รู้ตอนนี้เธอนั้นจะทำอะไรอยู่
                แต่ว่าฉันไม่ทำ
                ไม่เป็นอันทำอะไร เอาแต่คิดถึงเธอไปวันๆ
                เธอก็คงไม่รู้อะดิว่า 1 สัปดาห์น่ะมีอยู่ 7 วัน
                ในหนึ่งวัน 24 ชม. 1440 นาที
                86400 วินาที คิดถึงเธอทุกที
                เธอไม่รู้อะดิ เธอไม่รู้อะดิ เธอไม่รู้อะดิ
                (นี่เราอุตส่าห์ไปกูเกิ้ลมาเลยนะ)
                
                วันจันทร์ฉันคิดถึงเธออยู่
                วันอังคารไปหาได้ไหม
                หากวันพุธเธอต้องตื่นเช้า
                เดี๋ยวไปเจอตอนกลางคืนก็ได้ เดี๋ยวจะรอ
                พฤหัสศุกร์เธออยู่ไหน
                เสาร์อาทิตย์อยู่ด้วยกันไหม
                อยากเจอทุกวัน อยากเจอทุกวัน
                
                แค่อยากเจอ เธอทุกวัน
                แค่อยากเจอ เธอทุกวัน
                แค่อยากเจอ เธอทุกวัน
                แค่อยากเจอ แค่อยาก เจอ
                
                วันจันทร์ฉันคิดถึงเธออยู่
                วันอังคารไปหาได้ไหม
                หากวันพุธเธอต้องตื่นเช้า
                เดี๋ยวไปเจอตอนกลางคืนก็ได้ เดี๋ยวจะรอ
                พฤหัสศุกร์เธออยู่ไหน
                เสาร์อาทิตย์อยู่ด้วยกันไหม
                อยากเจอทุกวัน อยากเจอทุกวัน
                
                วันจันทร์ฉันคิดถึงเธออยู่
                วันอังคารไปหาได้ไหม
                หากวันพุธเธอต้องตื่นเช้า
                เดี๋ยวไปเจอตอนกลางคืนก็ได้ เดี๋ยวจะรอ
                พฤหัสศุกร์เธออยู่ไหน
                เสาร์อาทิตย์อยู่ด้วยกันไหม
                อยากเจอทุกวัน อยากเจอทุกวัน
                
                แค่อยากเจอ เธอทุกวัน
                แค่อยากเจอ เธอทุกวัน
                แค่อยากเจอ เธอทุกวัน
                แค่อยากเจอ แค่อยาก เจอ`,
        audio: '/upload/จันทร์อังคารพุธพฤหัสศุกร์เสาร์อาทิตย์ (Everyday).mp3',
        fav: 24565
    },
    {
        nameSong: "ดวงตา (Eyes)",
        imgSong: "https://www.dochord.com/wp-content/uploads/2022/05/Patrickananda.webp",
        type: "r&b",
        lyric: `ไม่เคยคิด ว่าชีวิตจะมีโอกาสได้ใกล้ชิด
        สิ่งมีที่ชีวิตที่เรียกว่าเธอคนนี้
        ฉันนั้นโชคดี
        ไม่เคยคิด ว่าคนอย่างฉันจะมีโอกาสได้พบเจอ
        
        คนดีๆ อย่างเธอคนที่เข้าใจ
        ไม่ว่าฉันจะเป็นอย่างไรเธอนั้นรู้
        ว่าฉันคงอยู่ไม่ไหว Girl you know
        That I would never could survive
        Without you without you
        
        แต่เมื่อฉันมองเข้าไปในดวงตา
        ทุกสิ่งที่เลวร้าย มีเธอคอยประคอง
        และบอกกับฉันว่า
        ให้ฉันมองเข้าไปในดวงตา
        ก่อนทุกสิ่งดับสลายแค่เรามีกันวันสุดท้าย
        ขออยู่ข้างเธอ ก็พอ
        
        ไม่เคยคิด ว่าหนึ่งชีวิต จะมีโอกาสได้รักเธอ
        คนดีๆ อย่างเธอ คนที่เข้าใจ
        รักของเราสำคัญแค่ไหน เธอนั้นรู้
        ว่าฉันคงอยู่ไม่ไหว Girl you know that
        I would never could survive
        Without you without you
        
        แต่หลายสิ่งหลายอย่างฉันไม่เคยได้พูดไป
        เพียงแค่มอง เธอเองก็คงจะพอรู้
        ไม่เคยคิดเลยว่ารักกับเธอขนาดนี้
        แต่ว่าในวันนี้ขอแค่เธอขอเพียงคนเดียว
        
        แต่เมื่อฉันมองเข้าไปในดวงตา
        ทุกสิ่งที่เลวร้าย มีเธอคอยประคอง
        และบอกกับฉันว่า
        ให้ฉันมองเข้าไปในดวงตา
        ก่อนทุกสิ่งดับสลายแค่เรามีกันวันสุดท้าย
        ขออยู่ข้างเธอ ก็พอ
        
        ก่อนทุกสิ่งดับสลายแค่เรามีกันวันสุดท้าย
        ขออยู่ข้างเธอ ก็พอ`,
        audio: '/upload/ดวงตา (Eyes).mp3',
        fav: 21025
    },
    {
        nameSong: "Oasis",
        imgSong: "https://i.ytimg.com/vi/otRfHGPN5vo/maxresdefault.jpg",
        type: "r&b",
        lyric: `สงสัยว่าทำไมวันนี้ เมฆบนฟ้าเล็กลงไป
        อาจจะเป็นเพราะฉันนั่งมองเครื่องบินที่อยู่ไกล ออกไป เท่านั้นเอง
        ทุกครั้งที่ฉันมองบนฟ้า แต่ละวันนั้นมีคำถามในใจ
        ว่าสิ่งที่ตามหา หรืออาจต้องมองมาตรงนี้
        
        แต่อยากให้รู้ไม่ว่าเธอจะมองออกไปที่ใด
        จะมีฉันตรงนี้เสมอ แม้ว่าฉันไม่พูดมัน
        
        ต่อให้วันที่ฟ้าไม่เป็นใจ ต่อให้วันที่ลมหนาวเท่าไร
        ต่อให้เธอต้องเจอเรื่องร้ายๆ สักแค่ไหน
        ขอแค่เธอหันมา และไม่ว่าเนิ่นนานเท่าไร
        และไม่ว่าเธอไม่มีใคร จะมีฉัน ที่คอยดูแลเป็นที่พักใจ
        I will always be your Oasis
        
        ถ้าเธอมองขึ้นไปบนฟ้า ในเวลาที่เหงาใจ
        เธอจะเห็นดวงดาวร้อยเรียงอยู่ห่างไกล
        เป็นเพื่อนเธอ
        
        แต่อยากให้รู้ไม่ว่าเธอจะมองออกไปที่ใด
        จะมีฉันตรงนี้เสมอ แม้ว่าฉันไม่พูดมัน
        
        ต่อให้วันที่ฟ้าไม่เป็นใจ ต่อให้วันที่ลมหนาวเท่าไร
        ต่อให้เธอต้องเจอเรื่องร้ายๆ สักแค่ไหน
        ขอแค่เธอหันมา และไม่ว่าเนิ่นนานเท่าไร
        และไม่ว่าเธอไม่มีใคร จะมีฉัน ที่คอยดูแลเป็นที่พักใจ
        I will always be your
        
        ต่อให้วันที่ฟ้าไม่เป็นใจ ต่อให้วันที่ลมหนาวเท่าไร
        ต่อให้เธอต้องเจอเรื่องร้ายๆ สักแค่ไหน
        ขอแค่เธอหันมา และไม่ว่าเนิ่นนานเท่าไร
        และไม่ว่าเธอไม่มีใคร จะมีฉัน ที่คอยดูแลเป็นที่พักใจ
        I will always be your oasis`,
        audio: '/upload/ดวงตา (Eyes).mp3',
        fav: 23452
    },
    {
        nameSong: "ทางออก (Exit)",
        imgSong: "https://i.ytimg.com/vi/dbrJn67V3rg/maxresdefault.jpg",
        type: "r&b",
        lyric: `นํ้าเสียงของเธอเปลี่ยนไป
        แต่ก่อนเคยเอาอกเอาใจ
        แต่ในวันนี้ทุกๆ สิ่งได้เปลี่ยนผันไป
        ไม่เหมือนเดิม
        
        สายตาที่เคยอ่อนไหว
        กลับไม่มองกันเหมือนเคย
        มันเป็นเพราะอะไร
        
        และก็ได้รู้เธอคงไม่กลับมา
        และก็ได้รู้เธอคงจากไปช้าๆ
        และก็ได้รู้ทุกสิ่งที่เธอทำ
        ชัดเจนในเลยวันนี้ เธอเปลี่ยนไป
        เพราะเธอแค่เพียงต้องการทางออก
        
        เธอเพียงต้องการทางออก
        
        เธอคงไม่รู้ว่าทุกวันนี้ฉันอยู่ยังไง
        ในทุกๆ วันมันต้องเจ็บชํ้าเท่าไร
        เมื่อไม่มีเธอคนดีมาอยู่ข้างกาย
        ไม่เหมือนเมื่อก่อน
        
        แต่ฉันยังคงหวังว่าเธอจะโทรมาหา
        แม้จะไม่มีวันที่เธอจะกลับมา
        แต่ใจก็ยังคงรอ
        
        และก็ได้รู้เธอคงไม่กลับมา
        และก็ได้รู้เธอคงจากไปช้าๆ
        และก็ได้รู้ทุกสิ่งที่เธอทำ
        ชัดเจนในวันนี้ เธอเปลี่ยนไป
        เพราะเธอแค่เพียงต้องการทางออก
        
        และก็ได้รู้เธอคงไม่กลับมา
        และก็ได้รู้เธอคงจากไปช้าๆ
        และก็ได้รู้ทุกสิ่งที่เธอทำ
        ชัดเจนในวันนี้ เธอเปลี่ยนไป
        เพราะเธอแค่เพียงต้องการทางออก`,
        audio: '/upload/ทางออก (Exit).mp3',
        fav: 16987
    }
];

function seedDB(){
    Artist.remove({},function(err){
        if(err){
            console.log(err)
        } else {
            console.log('Data removal complete');
            // removeUser();
            data.forEach(function(seed){
                Artist.create(seed, function(err, artist){
                    if(err){
                        console.log(err);
                    } else {
                        console.log('New data added!');
                    }
                });
            });
            Song.remove({},function(err){
                if(err){
                    console.log(err);
                } else {
                    addSong('Tilly Birds', songTilly);
                    addSong('Nont Tanont(นนท์ ธนนท์)', songNont);
                    addSong('THE TOYS(เดอะ ทอย)', songToys);
                    addSong('F.Hero(กอล์ฟ ฟลักกลิ้งฮีโร่)', songHero);
                    addSong('Kangsomks(แกงส้ม ธนทัต)', songKang);
                    addSong('Patrickananda(แพทริค อนันดา)', songPatrick);
                }
            });
        }
    });
}

function addSong(name, song){
    song.forEach(function (addSong){
        Song.create(addSong,function(err, allSong){
            if(err){
                console.log('add song error');
                console.log(err);
            }
            else{
                Artist.findOne({name : name.toString()},function(err, foundArtist){
                    if(err){
                        console.log('find error');
                        console.log(err);
                    }
                    else
                    {                 
                        allSong.artist.name = foundArtist.name;
                        allSong.artist.id   = foundArtist._id;
                        allSong.save();
                        foundArtist.songs.push(allSong);
                        foundArtist.save();
                    }
                });
            }
        });
    });
}

function removeUser(){
    User.remove({}, function(err){
        if(err){
            console.log(err);
        }
        else{
            console.log('User has been removed.');
        }
    });
}

module.exports = seedDB;